[{
        "body": "Now I have to say \"Leroy can you please paint the fence?\"",
        "id": "5tz52q",
        "score": 1,
        "title": "I hate how you cant even say black paint anymore"
    },
    {
        "body": "Pizza doesn't scream when you put it in the oven .\n\nI'm so sorry.",
        "id": "5tz4dd",
        "score": 0,
        "title": "What's the difference between a Jew in Nazi Germany and pizza ?"
    },
    {
        "body": "...and being there really helped me learn about American culture. So I visited a shop and as I was leaving, the Shopkeeper said \"Have a nice day!\" But I didn't so I sued him.",
        "id": "5tz319",
        "score": 0,
        "title": "I recently went to America...."
    },
    {
        "body": "A Sunday school teacher is concerned that his students might be a little confused about Jesus, so he asks his class, “Where is Jesus today?”\nBrian raises his hand and says, “He’s in Heaven.”\n\nSusan answers, “He’s in my heart.”\n\nLittle Johnny waves his hand furiously and blurts out, “He’s in our bathroom!”\n\nThe teacher is surprised by this answer and asks Little Johnny how he knows this.\n\n“Well,” Little Johnny says, “every morning, my Dad gets up, bangs on the bathroom door and yells ‘Jesus Christ, are you still in there?'”",
        "id": "5tz2wj",
        "score": 1,
        "title": "Brian raises his hand and says, “He’s in Heaven.”"
    },
    {
        "body": "He got caught trying to sell the two books to a freshman.",
        "id": "5tz1pc",
        "score": 0,
        "title": "You hear about the University book store worker who was charged for stealing $20,000 worth of books?"
    },
    {
        "body": "Because the p is silent.",
        "id": "5tz1o1",
        "score": 0,
        "title": "Why is it unknown on how pterodactyls urinate especially during flight?"
    },
    {
        "body": "To avoid leaving tracks like a snail while walking.",
        "id": "5tz0ef",
        "score": 0,
        "title": "Why women need legs?"
    },
    {
        "body": "Apparently \"Whatever's low in cholesterol\" was not the right answer.",
        "id": "5tz04j",
        "score": 1,
        "title": "I walked into a PETA adoption center and the receptionist asked me what kind of dog I wanted"
    },
    {
        "body": "Character actors!",
        "id": "5tz02q",
        "score": 0,
        "title": "How did TV studios make words appear on screen before computers?"
    },
    {
        "body": "You follow his fresh prints. ",
        "id": "5tz02h",
        "score": 0,
        "title": "How do you find Will Smith in the snow?"
    },
    {
        "body": "I always thought they were gunna hit me, not that they were going to destroy the housing market 20 years later.",
        "id": "5tyzxh",
        "score": 15,
        "title": "Remember when you were a kid and when you cried your parents said, \"I'll give you a reason to cry\"?"
    },
    {
        "body": "... Anal Destiny.",
        "id": "5tyzx4",
        "score": 0,
        "title": "Remember, you can't spell Valentine's Day without..."
    },
    {
        "body": "Oh and it's also Valentines day",
        "id": "5tyze2",
        "score": 0,
        "title": "Happy try not to jump off a bridge day!"
    },
    {
        "body": "I said, \"I'm not sure; it's hard to keep track.\"",
        "id": "5tyytx",
        "score": 3,
        "title": "My boss said to me, \"you're the worst train driver ever. How many have you derailed this year?\""
    },
    {
        "body": "cuz all they do is Tweet",
        "id": "5tyyo2",
        "score": 1,
        "title": "If I get a bird I'm naming it Trump"
    },
    {
        "body": "But my back was sore and I couldn't reach.",
        "id": "5tyxrb",
        "score": 0,
        "title": "I was going to get a headjob for Valentines Day"
    },
    {
        "body": "When she woke up after 6 months and 3 days, the doctor told the mother: \"While you were in a coma, we had your brother name your children. One is a boy, one is a girl.\"\n\nThe mother, with a disappointed and angry look on her face told the doctor: \"Why my brother? That guy is an idiot. So what did he name them?\"\n\nThe mother, expecting hideous names, prepared herself.\n\n\"The girl, was named Denise.\" The mother thought, \"Hey that wasn't so bad. What about my boy?\"\n\nThe doctor said, \"Denephew\".",
        "id": "5tyx6v",
        "score": 3,
        "title": "A mother went into a coma after giving birth to twins"
    },
    {
        "body": "An epileptical. ",
        "id": "5tywci",
        "score": 2,
        "title": "What do you call an exercise machine with a strobe light?"
    },
    {
        "body": "...and a lifetime ban from the local zoo. ",
        "id": "5tyt6c",
        "score": 2,
        "title": "My dad has a heart of a lion"
    },
    {
        "body": "But the bigger, heavier ones are delivered by a crane. ",
        "id": "5tyqqw",
        "score": 3,
        "title": "Smaller babies may be delivered by a stork."
    },
    {
        "body": "Welcome to India",
        "id": "5tyqqi",
        "score": 0,
        "title": "A monkey is getting stoned in a zoo..."
    },
    {
        "body": "A young boy says to his father \"Dad, our math teacher is asking to see you.\"\n\n\"What happened?\" The father asks.\n\n\"Well, she asks me, 'how much is 7 * 9?' I answer '63' , then she asks, 'and 9 * 7?' so I asked 'what's the fucking difference?' \"\n\n\"Indeed, what is the difference?\" asks the father. ''Sure, I'll go.''\n\nThe next day, the boy comes home from school \"Dad, have you gone by the school?\" He asks.\n\n\"Not yet.\"\n\n\"Well when you do, come and see the gym teacher also.\"\n\n\"Why?\" asks the father.\n\nThe boy explains, \"Well we had a gym class today, and he asked me to raise my left arm, I did. Then my right arm, I also raised it. Then he asked me to lift my right leg, so I did. 'Now,' he says, 'lift your left leg,' so I asked 'What, am I suppose to stand on my cock!?'\"\n\n\"Exactly,\" says the father. \"Alright, I'll come.\"\n\nThe next day, the boy asks his father \"Did you go to the school?\"\n\n\"No, not yet.\"\n\n\"Don't bother, I got expelled.\"\n\nSurprised, the father asks \"Why did you get expelled?\"\n\n\"Well, they summoned me to the principal's office, and sitting there were the math teacher, the gym teacher, and the art teacher.\"\n\n\"The fuck was the art teacher doing there!?\" asks the father.\n\n\"That's what I said\" replied the boy.",
        "id": "5tyqag",
        "score": 62,
        "title": "I've translated a popular Russian joke to English , wanna hear you reaction ))"
    },
    {
        "body": "I dont have any, go ask your fava",
        "id": "5tymmf",
        "score": 1,
        "title": "What did the mommy bean say to her son when he asked for money?"
    },
    {
        "body": "And save $300 instantly.",
        "id": "5tymff",
        "score": 1,
        "title": "When You Break Up At 11:59 Tonight"
    },
    {
        "body": "But I can't A4'd it.",
        "id": "5tylhy",
        "score": 4,
        "title": "I wanted to buy an Audi."
    },
    {
        "body": "It's about a girl with amnesia talking to her Grandmother.\nThe lyrics are \"Oh, Nana, What's My Name?\"",
        "id": "5tyl5a",
        "score": 1,
        "title": "I'm Trying to Remember The Name of A Song"
    },
    {
        "body": "Lesser people. ",
        "id": "5tykxd",
        "score": 0,
        "title": "What are minorities?"
    },
    {
        "body": "Because all of his cells have built a wall.",
        "id": "5tyk3b",
        "score": 3,
        "title": "Did you hear that Donald Trump is technically a plant?"
    },
    {
        "body": "my neck was stiff for 4 hours",
        "id": "5tyj4u",
        "score": 2,
        "title": "i had trouble swallowing a viagra last night"
    },
    {
        "body": "The Ruler",
        "id": "5tyii8",
        "score": 11,
        "title": "What is the king of all school supplies?"
    },
    {
        "body": "Since he was permanently disfigured, he decided to give up playing rugby for good.\n\n His club and insurance company ensured that a large sum of money went his way.\n\nOne day, he decided to invest his money in a small but growing sportswear business. \n\nHe bought the company outright but after signing on the dotted line, realized that he knew nothing about business. \n\nHe decided to employ someone to run the shop.\n\nThe next day he set up three interviews. \n\nThe first guy was great. \n\nHe knew everything he needed to and was very enthusiastic. \n\nAt the end of the interview, the former rugby player asked him, “Do you notice anything different about me?”\n\nAnd the man replied, “Why, yes, I couldn’t help noticing you have no ears.” \n\nThe rugby player got angry and threw him out.\n\nThe second interview was with a woman, and she was even better than the first guy. \n\nHe asked her the same question, “Do you notice anything different about me?”\n\nShe replied: “Well, you have no ears.” \n\nHe got upset again and showed her the door.\n\nThe third and last interview was with the best of the three. \n\nHe was a very young man fresh out of college. \n\nHe was smart and handsome and seemed to know all about the sportswear business.\n\nThe rugby player was anxious, but went ahead and asked him the same question: “Do you notice anything different about me?”\n\nTo his surprise the young man answered: “Yes, you wear contact lenses.”\n\nThe former rugby player was shocked, and said, “What an incredibly observant young man you are. How in the world did you know that?”\n\nThe young man fell off his chair laughing hysterically and replied, “Well, it’s pretty hard to wear glasses with no flipping ears!”",
        "id": "5tygzy",
        "score": 12,
        "title": "A rugby player was hurt very badly during a scrum and he had both of his ears ripped off..."
    },
    {
        "body": "A man was in his front yard mowing grass when his attractive blonde female neighbor came out of the house and went straight to the mail box.\n\nShe opened it, slammed it shut, and stormed back in the house.\n\nA little later she came out of her house and again went to the mail box and again opened it, then slammed it shut again. Angrily, back into the house she went.\n\nAs the man was getting ready to edge the lawn, here she came out again, marched to the mail box, opened it and then slammed it closed harder than ever.\n\nPuzzled by her actions the man asked her, “Is something wrong?”\n\nTo which she replied, “There certainly is! My stupid computer keeps giving me a message saying, “YOU’VE GOT MAIL!”",
        "id": "5tygyu",
        "score": 1,
        "title": "A man was in his front yard mowing grass when his attractive blonde female !!"
    },
    {
        "body": "A woman runs into a doctor’s office and says “DOCTOR! DOCTOR! You have to help me! Everywhere I touch on my body it hurts!”\n\nThe doctor replied, “Show me.”\n\nSo the woman poked her ankle and screamed of pain. Then she poked her knee and yelled OW. She poked her forehead and screamed again.\n\nShe was about to continue when the doctor said, “That’s enough, let me think this over.” He thought for about a minute and said “I think I know what your problem is. You broke your finger.”",
        "id": "5tygq5",
        "score": 5,
        "title": "A woman runs into a doctor’s office and says “DOCTOR! DOCTOR! You have to help me! Everywhere I touch on my body it hurts!”"
    },
    {
        "body": "Because interest in the Bond is so low.",
        "id": "5tyfyh",
        "score": 3,
        "title": "Why did the producers of 007 films use government debt to fund their newest film?"
    },
    {
        "body": "Happy pocket empty day.",
        "id": "5tyfoj",
        "score": 2,
        "title": "Pocket empty day !"
    },
    {
        "body": "…but she probably isn't available.",
        "id": "5tyf21",
        "score": 2,
        "title": "I want to see that new movie coming out with Scarlett Johannson…"
    },
    {
        "body": "He has no compass and he has lost his sense of direction. \n\nSuddenly he sees a caravan on the horizon. He jumps, shouts and waves his arms to get their attention, and, oh joy, they notice him and move in his direction. \n\nBut his happiness is short lived, as the travelers turn out to be mean and sadistic. They rough him up, and then bury him in the sand with only his head above the surface.\n\nHe grimly contemplates whether he'll die of sun stroke, dehydration or from attack of some savage beast. Suddenly, a lone traveler appears in front of him and inquires about his predicament. \n\n**You see, first I got lost, without a compass and provisions. Then I encountered these sadists, who beaten me up, bury me this way and left... Can you believe such behavior?**\n\n**Tsk, tsk...** says the traveler, as he puts his foot on top of the man's head and pushes it under the surface **Amateurs, such amateurs...**",
        "id": "5tyezd",
        "score": 3,
        "title": "Man gets lost in the desert."
    },
    {
        "body": "You have to drop the Bomb twice before she gets the Message. \n",
        "id": "5tyess",
        "score": 37,
        "title": "Why is it so hard to break up with a Japanese Girl?"
    },
    {
        "body": "All that is left after tens of snowmen were brutally melted on this spot by a massive indifferent ball of fire.",
        "id": "5tyegn",
        "score": 0,
        "title": "Site of the 2017 Dane county massacre."
    },
    {
        "body": "A small child asks his father:\n\nBoy: Dad, where did I come from?\n\nDad: The Stork, son.\n\nBoy: what's wrong with you dad? Your wife is so gorgeous yet you're out fucking The Stork?",
        "id": "5tyef7",
        "score": 0,
        "title": "He fucked what?"
    },
    {
        "body": "I told her she should try the kitchen",
        "id": "5tyeec",
        "score": 0,
        "title": "My wife wants to eat somewhere shes never eaten before for V-Day"
    },
    {
        "body": "In exchange, I was supposed to advertise some kind of bathroom cleaner. Of course I declined, because I am a person with high moral standards and strong willpower. Just as strong as Ajax, the super strong bathroom cleaner. Now available with scented lemon or vanilla.",
        "id": "5tydto",
        "score": 4,
        "title": "I was offered sex with a 21 yr old today"
    },
    {
        "body": "\"The other day I touched my husband's balls and realized that they are cold. Never noticed before!\" - says the first. \n\nNext day the second woman tells to the others:\n\n\"That's true! I touched my husband's balls and they are also cold. It's curious.\" \n\nNext day the third woman appears with her eye blacked. \n\n\"What happened?\" - her friends wonder.\n\n\"Well, I touched my husband's balls and then asked him why his balls are warm but all other men have them cold.\"",
        "id": "5tydjg",
        "score": 6,
        "title": "3 women talk"
    },
    {
        "body": "The ones who bang on the wall, And the ones who bang on the wall because I'm banging my girlfriend on the wall",
        "id": "5tydi6",
        "score": 1,
        "title": "There are two types of people"
    },
    {
        "body": "Someone stepped on its mouse.",
        "id": "5tyd57",
        "score": 3,
        "title": "Why did the computer squeak?"
    },
    {
        "body": "Your moms bed.",
        "id": "5tycln",
        "score": 3,
        "title": "i found a place where the recycling rate is 98%."
    },
    {
        "body": "My wife sat down on the couch  next to me as I was flipping channels.\nShe asked, 'What's on TV?'  \nI said, 'Dust.' And then the fight started....\n\nMy wife was hinting about what she wanted for our upcoming anniversary. She said, 'I want something shiny that goes from 0 to 100 in about 3 seconds.'\n\nI bought her a weighing scale. And then the fight started....\n \n\nWhen I got home last night, my wife demanded that I take her someplace expensive.\n\nSo I took her to a petrol pump. And then the fight started....\n  \nMy wife was standing & looking in the bedroom mirror. She was not happy with what she saw and said to me, 'I feel horrible. I look old, fat and ugly. I really need you to give me a compliment.\"\n\nI replied, \"Your eyesight is perfect.\" And then the fight started....\n  \nI asked my wife, \"Where do you want to go for our anniversary?\"\nIt warmed my heart to see her face melt in sweet appreciation.\n\"Somewhere I've not been in a long time.\"\n\nSo I took her to my parents' house. And then the fight started....\n",
        "id": "5tybk6",
        "score": 6,
        "title": "Valentine's day fights"
    },
    {
        "body": "She died a virgin but she sure wasn't buried one",
        "id": "5tybdq",
        "score": 0,
        "title": "I feel so bad for the necrophiliac's sister"
    },
    {
        "body": "A Calendar has a date on Valentine's day.",
        "id": "5tybdd",
        "score": 14,
        "title": "What's the difference between you and a Calendar?"
    },
    {
        "body": "He tried to make eggs.   He broke the yoke.\n\nYoke! Oh! Oh no!",
        "id": "5tyanf",
        "score": 0,
        "title": "Julian Lennon messed up breakfast"
    },
    {
        "body": "'Hello!?'\n\n'Hey! Honey, you wouldn't believe the day I'm having right now, I lost my phone!'\n\n'Hello, I'm not your wife, I'm Cecelia, your new maid!'\n\n'Oh! That's great! Welcome! I'm having a crazy day right now, can you please hand the phone to my wife?'\n\n'I would but she just locked her room and went in with another man!'\n\n'What!! That's a disaster! As if this day wouldn't get worse!! All these years, all this love for this day! I can't bear this anymore'\n\n'I'm really sorry to hear that!'\n\n'Don't be sorry, it's not your fault! I need a moment to think but time is running out! Do one thing... In the drawer below the phone there's a gun!'\n\n'What!! I won't do anything stupid!!'\n\n'No.. You don't understand.. I'm very rich and powerful.. No one can touch you and I'll pay you a million!'\n\n'But...'\n\n'I'll pay you two million but you have to be quick about it, he shouldn't get away!'\n\n'Okay..'\n\n\nCecelia steps away and there are two bangs that are heard.\n\n\n'I've done it'\n\n'Excellent! Now throw the bodies in the empty pool at the back and I'll take care of them when I get back'\n\n'What pool!???'\n\n'Umm.. Is this 852236709?'",
        "id": "5tyajc",
        "score": 3,
        "title": "A guy calls home"
    },
    {
        "body": "This post.",
        "id": "5tyabb",
        "score": 0,
        "title": "I found a place where the recycling rate is 100%"
    },
    {
        "body": "I'm a dog.\n\nHappy Valentine's Day!",
        "id": "5ty9jc",
        "score": 11,
        "title": "Roses are gray. Violets are gray."
    },
    {
        "body": "Don't worry, we have our Trump card.",
        "id": "5ty9am",
        "score": 0,
        "title": "I hear the Mexicans are planning an attack on America"
    },
    {
        "body": "They said thank you. I said don't mention it.",
        "id": "5ty7fl",
        "score": 7,
        "title": "I bought my friend an elephant for their room."
    },
    {
        "body": "But I'm laughing braces I just farted. ",
        "id": "5ty56m",
        "score": 0,
        "title": "You're laughing because I'm laughing."
    },
    {
        "body": "She said \"Honey, we've been married for 7 years. I think you have amnesia.\"",
        "id": "5ty3r5",
        "score": 2,
        "title": "This guy proposed to his wife after walking away from a terrible car accident without a scratch. He said \"Life's too short and it can end at any time.\""
    },
    {
        "body": "But only once",
        "id": "5ty39a",
        "score": 2,
        "title": "TIL you can drink lava"
    },
    {
        "body": "Houston we have a problem...OK what is it? If you don't know already I am not going to tell you. You wouldn't understand.",
        "id": "5ty36v",
        "score": 1,
        "title": "First woman on mars."
    },
    {
        "body": "I give you, \"The Lamb That Thyme Forgot\" ",
        "id": "5ty2u6",
        "score": 1,
        "title": "Recipe idea: rosemary and thyme lamb, without the thyme."
    },
    {
        "body": "José and Hose B.",
        "id": "5ty2qy",
        "score": 2,
        "title": "What are the two most common names of Mexican fire-fighter?"
    },
    {
        "body": "... and he said \"Fuck the Police\"",
        "id": "5ty263",
        "score": 3,
        "title": "Ice Cube was asked if there was a rock band from the 80's of which he would have sex with all the members of..."
    },
    {
        "body": "Apparently using the words \"Never opened\" is no good, when trying to sell a parachute..",
        "id": "5ty1st",
        "score": 2,
        "title": "Bad Advertisement"
    },
    {
        "body": "Cacti are thorny\n\nI just can't help that\n\nYou make me horny",
        "id": "5ty14u",
        "score": 4,
        "title": "Roses are red."
    },
    {
        "body": "And they are very private. Ever since they were young they wouldn't talk about sex publicly, but instead developed a code phrase: Doing a load of laundry. \n\nOne night they are out at the pub, having a couple drinks, and Seamus turns to Mary and asks \"D'ya fancy going home and doing a load of laundry?\"\n\nMary looks at Seamus and says \"you know that sounds lovely. Let's do.\"\n\nThey finish their drinks and head home together. \n\nAt home they are sitting in front of the fire, Seamus smoking his pipe and Mary with her knitting. Seamus asks \"Mary? D'ya still fancy that load of laundry?\" \n\nMary looks at Seamus and says \"aye I do, I really do. Let me just finish my knitting.\"\n\nSo Seamus gets up and heads to the bed room. \n\nMary keeps knitting and forgets all about Seamus. \n\nAfter an hour she realizes she forgot and jumps up and rushes to the bedroom. \"Seamus?\" Mary asks, \"D'ya still fancy doing a load of laundry?\"\n\nFrom under the covers Seamus replies \n\n\"Y'know, Mary, it was a small load, so I did it by hand.\"",
        "id": "5ty0wy",
        "score": 4,
        "title": "So Seamus and Mary are an elderly couple"
    },
    {
        "body": "It's all just flake news.",
        "id": "5txziy",
        "score": 5,
        "title": "These reports of a major snowstorm hitting the Northeast don't concern me."
    },
    {
        "body": "A young Native American boy goes up to the chief of his tribe and asks \"Chief, how did we get our names?\"\n\nThe Chief looked at the boy and said \"Oh, that's simple. All parents in our tribe named their children after something that was occurring during their birth. For example, Snowflake was born during a great blizzard. Ember was born during a raging wildfire.\n\nWhy do you ask, Two Dogs Fucking?\"",
        "id": "5txzbr",
        "score": 1,
        "title": "Why do you ask?"
    },
    {
        "body": "Yep, that's the joke. Funny how reality has become a joke. ",
        "id": "5txyle",
        "score": 0,
        "title": "Those ads actually ran."
    },
    {
        "body": "Customers who wish to purchase an item must use code-phrases to avoid the authorities' suspicion.\n\nOne night a blind man stops by the stand.\n\n\"What would you like to purchase today?\" asks the cashier.\n\n\"Oh, nothing\" the blind man says, \"I was just *looking* around!\"\n\nAn few hours later, a deaf man approaches the stand.  The cashier realizes he can't hear him, and uses sign-language to ask what he'd like to purchase.\n\n\"Well, I *heard* you guys are having a sale!\" the deaf man states with a wink and a nudge.\n\nFinally, just before that night's closing time, a muscular man with no apparent disability walks up to the stand.  The cashier asks what he'd like to purchase.\n\n\"I don't know ... I heard you guys sold *cherries*!\" the man states with a look of subtle expectation.\n\nThe cashier, despite going through his mental checklist of code-phrases, has no idea what he wants.\n\n\"I'm sorry, we've sold-out on that item.\" the cashier says with a puzzled stare.\n\n\"Ah *motherfucking* christ!\" the man screams in pseudo-frustration.  However, the cashier just stands there with an agitated face.\n\nThe customer, realizing his attempts aren't getting through to the employee, tries a different approach.\n\n\"Well, that's a darn shame!\" he continues. \n\"And I travelled across the entire *count-*\" \n\nThe man coughs.\n\n\"-ry to get here!\"\n",
        "id": "5txxuo",
        "score": 1,
        "title": "There's a bizarre black-market concession stand in North America which sells only human body parts"
    },
    {
        "body": "Should have cooked it on aloha temperature ",
        "id": "5txxsu",
        "score": 54,
        "title": "Burnt my Hawaiian pizza today"
    },
    {
        "body": "Because its full of Arab semen.",
        "id": "5txxq7",
        "score": 12,
        "title": "Why is the camel called the ship of the desert?"
    },
    {
        "body": "A gorgeous young redhead goes into the doctor's office and said that her body hurt wherever she touched it.\n\n'Impossible!' says the doctor. 'Show me.' \n\nThe redhead took her finger, pushed on her left shoulder and screamed, then she pushed her elbow and screamed even more. She pushed her knee and screamed; likewise she pushed her ankle and screamed. Everywhere she touched made her scream.\n\nThe doctor said, 'You're not really a redhead, are you? 'Well, no' she said, 'I'm actually a blonde.' \n\n'I thought so,' the doctor said, 'Your finger is broken.'",
        "id": "5txwsv",
        "score": 13,
        "title": "A gorgeous young redhead goes into the doctor's office and said that her body hurt wherever she touched it..."
    },
    {
        "body": "Yeah I figured you wouldn't know.",
        "id": "5txvq7",
        "score": 3,
        "title": "What does a women say after having 3 orgasms in a row?"
    },
    {
        "body": "Clearly those people love to live in constant fear of disaster.",
        "id": "5txvd6",
        "score": 2,
        "title": "The towns being evacuated under the Oroville Dam all voted Pro-Trump."
    },
    {
        "body": "A man gets really drunk at a bar and asks the bartender for the bathroom.  The bartender points to the bathroom and the man complains about having to take a serious shit and runs towards it.\n\nA few minutes later the man screams in agony, stops, then screams again.  The bartender goes to check it out and yells to the man, \"What the hell is going on?\"\n\n\"Everytime I press the lever, I feel like my balls are getting crushed!\" the drunk yells.\n\n\"You drunk bastard,\" the bartender replies, \"you're sitting on the mop strainer again!\"",
        "id": "5txv65",
        "score": 7,
        "title": "A Man Gets Really Drunk"
    },
    {
        "body": "I don't know... but the flag is a big plus. 🇩🇰",
        "id": "5txurc",
        "score": 3,
        "title": "What's the best thing about living in Switzerland?"
    },
    {
        "body": "He was also a serial killer. He liked to dig up the corpses of women and use their skin to furnish his house. After the police arrested him they discovered a whole morbid collection of objects. He had a belt made out of ears, a lampshade made from stitched together faces, they even found a labia menora. ",
        "id": "5txuaa",
        "score": 1,
        "title": "Did you hear about Leatherface's jewish cousin?"
    },
    {
        "body": "Is one mile closer to the stone. ",
        "id": "5txu52",
        "score": 1,
        "title": "A milestone"
    },
    {
        "body": "I do it on Christmas and Easter.",
        "id": "5txtyd",
        "score": 9,
        "title": "I floss religiously."
    },
    {
        "body": "But this Guy Fawkes.",
        "id": "5txtk8",
        "score": 3,
        "title": "I used to think everyone on 4chan was a virgin,"
    },
    {
        "body": "The attic",
        "id": "5txte1",
        "score": 1,
        "title": "What part of the house got busted for drugs?"
    },
    {
        "body": "Me : well, you could say I bring a lot to the table.",
        "id": "5txsm2",
        "score": 10,
        "title": "Manager : So do you think you'd be a good waiter?"
    },
    {
        "body": "I have a couple of ideas:\n\n1: Dinner\n2: Movies\n\n1 or 2? 1.. 2..? 1..... or 2?",
        "id": "5txs4x",
        "score": 14,
        "title": "An optometrist asks a woman out on a date"
    },
    {
        "body": "He made him an offer he couldn't understand. ",
        "id": "5txs3z",
        "score": 1,
        "title": "Did you hear about the Chinese godfather?"
    },
    {
        "body": "The bartender sighs and says; \"I'll serve you, but don't start anything!\"",
        "id": "5txrfd",
        "score": 9,
        "title": "A pair of jumper cables walks into a bar"
    },
    {
        "body": "A Brazilian. ",
        "id": "5txrcr",
        "score": 19,
        "title": "How many South Americans does it take to change a light bulb?"
    },
    {
        "body": "One day it just clicked.",
        "id": "5txr27",
        "score": 2,
        "title": "Scientists have been trying to talk to dolphins for years."
    },
    {
        "body": "Must be something in the pussy they're eating",
        "id": "5txpo9",
        "score": 0,
        "title": "They say only men and lesbians can be funny..."
    },
    {
        "body": "A Submarine.\n\n",
        "id": "5txomv",
        "score": 0,
        "title": "What’s long and hard and full of semen?"
    },
    {
        "body": "Dad: Look son, you see those two people walking by?, if I had seen 4, I would've been drunk.\n\nSon: But dad, there's only one person.",
        "id": "5txoil",
        "score": 39,
        "title": "Dad, how do you know if someone is drunk?"
    },
    {
        "body": "He/she wanted to win the no-bell prize. ",
        "id": "5txohj",
        "score": 3,
        "title": "Why did the scientist install a knocker on his/her door?"
    },
    {
        "body": "He finally settles on a perfect Black Angus bull. He says to the owner \"Here's the money. I need to send a message to my wife to come pick up the bull. She already knows where I am but I need her to come pick him up now before it gets dark. Where can a fella send a telegram?\" The owner tells him that he has a machine but it is $100 a word. \"That's outrageous! I only have $100.\" The owner says to him \"Better make it good then.\" The man thinks for a few minutes and plops down the cash. \"Send her this word: Comfortable.\" The owner of the bull looks confused and asks \"How will that tell her anything?\" To which the man replies \"Well my wife can barely read, so she'll just read it reeeeeeal slow.\"",
        "id": "5txnv8",
        "score": 25,
        "title": "A man is shopping for cattle in 1886..."
    },
    {
        "body": "As it turns out it already existed but i came to it on my own",
        "id": "5txnr5",
        "score": 2,
        "title": "I thought of the first Fleshlight"
    },
    {
        "body": "   Q: Doctor, before you performed the autopsy, did you check for a\n pulse?\n\n      A: No.\n\n      Q: Did you check for blood pressure?\n\n      A: No.\n\n      Q: Did you check for breathing?\n\n      A: No.\n\n      Q: So, then it is possible that the patient was alive when you\n\n          began the autopsy?\n\n      A: No.\n\n      Q: How can you be so sure, Doctor?\n\n      A: Because his brain was sitting on my desk in a jar.\n\n      Q: But could the patient have still been alive nevertheless?\n\n      A: Yes, it is possible that he could have been alive and practicing law somewhere.\n\nz\n\nPS. This is actual testimony from a trial...........\n\n",
        "id": "5txnqz",
        "score": 6,
        "title": "Doctor, are you sure he was Dead?"
    },
    {
        "body": "He took a bite from one of his prey and complained that it was \"FUCKING RAAAAAAWWWWW!\" ",
        "id": "5txn3n",
        "score": 4,
        "title": "Why are the dinosaurs afraid of Gordon Ramsey?"
    },
    {
        "body": "So if you're a great driver, look out for women who are turning.",
        "id": "5txmyo",
        "score": 16,
        "title": "A lot of women turn into great drivers..."
    },
    {
        "body": "Blonde #1: Oh how I hate when he brings me flowers. All night I'll be on my back with my legs in the air.\nBlonde #2: Don't you own a vase? ",
        "id": "5txmlh",
        "score": 4,
        "title": "Valentines Day Flowers"
    },
    {
        "body": "Espn2 ",
        "id": "5txm9l",
        "score": 2,
        "title": "#1 Uconn women's team going for historic 100th consecutive team in a sold out stadium against #6 South Carolina"
    },
    {
        "body": "He breaks into a house to look for money and guns and finds a young couple in bed.\n\nHe orders the guy out of bed and ties him to a chair, while tying the girl to the bed he gets on top of her, kisses her neck, then gets up and goes into the bathroom. While he's in there, the husband tells his wife:\n\n\"Listen, this guy's an escaped convict, look at his clothes! He probably spent lots of time in jail and hasn't seen a woman in years. I saw how he kissed your neck.\" If he wants sex, don't resist, don't complain, do whatever he tells you. Satisfy him no matter how much he nauseates you. This guy is probably very dangerous. If he gets angry, he'll kill us. Be strong, honey. I love you.\"\n\nTo which his wife responds: \"He wasn't kissing my neck. He was whispering in my ear. He told me he was gay, thought you were cute, and asked me if we had any vaseline. I told him it was in the bathroom. Be strong honey. I love you too!!\"",
        "id": "5txluy",
        "score": 6,
        "title": "A man escapes from prison where he has been for 15 years"
    },
    {
        "body": "And he gets to live in the White House to boot!",
        "id": "5txlkj",
        "score": 0,
        "title": "Did you hear the outrage over the rapist getting four years?"
    },
    {
        "body": "“Get in the car bitch……I got a gun!”",
        "id": "5txko2",
        "score": 0,
        "title": "Sure Fire Pickup Line"
    },
    {
        "body": "He didn't. He's dead. ",
        "id": "5txkjs",
        "score": 0,
        "title": "Why did Michael Brown cross the road?"
    },
    {
        "body": "Is pretty ironic",
        "id": "5txkf9",
        "score": 3,
        "title": "The term OP on r/Jokes"
    },
    {
        "body": "I always have heated debate about it with my friend residing in the other hemisphere.",
        "id": "5txk4p",
        "score": 0,
        "title": "I'm an avid supporter of the Flat Earth Society!"
    },
    {
        "body": "At first, people in California were like \"Oh, we don't have enough water!\" and now they're like \"Oh, we have too much water!\"\n___\nThey can't make up their *dam* minds.  ",
        "id": "5txju2",
        "score": 5,
        "title": "People in California..."
    },
    {
        "body": "The steaks could not be higher.",
        "id": "5txjhw",
        "score": 3,
        "title": "I took ribeye to the top of Everest..."
    },
    {
        "body": "He excitedly sits down in his seat and his family takes their seats to his right. The game is about to start and he notices the seat next to his left is empty. He leans over to the guy a seat over and says, 'Hey man, did you buy this seat? Who would miss the super bowl!?'\n\nThe man says to him, 'Yeah, I bought it for my wife but she passed away.'\n\nThe first guy says, 'Oh, man, I'm so sorry to hear that... didn't you have a family member or friend that wanted the seat? I mean... It's the super bowl.'\n\nThe man says, 'Yeah, there were a few, but they're all at the funeral.'\n\n*****I know its a month late, but a co-worker just told me this and his jokes are usually terrible grandpa-level jokes, so I had to post it.*****",
        "id": "5txja2",
        "score": 8,
        "title": "A man finally buys tickets to bring his family to the super bowl..."
    },
    {
        "body": "To beat the crowd.",
        "id": "5txj9n",
        "score": 10,
        "title": "Why do the riot police show up at concerts early?"
    },
    {
        "body": "or 5 plus 7 are 13?",
        "id": "5txj4q",
        "score": 0,
        "title": "Would you say 5 plus 7 is 13"
    },
    {
        "body": "Two guys are hitchhiking down the highway.  At the same time an older couple is driving on the same road.  The man has diarrhea something fierce.  Every few miles he has his wife pull into a service station.  Finally she gets tired of this and tells him “I’m not stopping. If you have to go that bad, hang your ass out the window and go”. \n\nSo the man does this as they’re passing the hitchhikers, one of which get’s the full load  on him.  “Damned snooze chewers!!!” he yells. \n\nBut his partner says “Yeah, but did you see the JAWS on that sumbitch”.",
        "id": "5txinv",
        "score": 3,
        "title": "Jaws"
    },
    {
        "body": "She couldn't control her Pewp Hole.",
        "id": "5txijz",
        "score": 1,
        "title": "My substitute teacher had diarrhea..."
    },
    {
        "body": "  A businessman boards a flight and is lucky enough to be \n  seated next to an absolutely gorgeous woman. They \n  exchange brief hellos and he notices she is reading a manual about sexual statistics. He asks her about it and she replies, \n  \"This is a very interesting book about sexual statistics. \n  It identifies that American Indians have the longest \n  average penises and Polish men have the biggest average \n  diameter. By the way, my name is Jill. What's yours?\" \n  He coolly replies, \"Tonto Kawalski, nice to meet you.\"",
        "id": "5txidp",
        "score": 33,
        "title": "Sex Statistics on a Plane."
    },
    {
        "body": "Crowd : D:<\n\n\nMe: Nazis. . . . .\n\n\nCrowd: *Sigh of relief*\n\n\nMe: Especially Hans   . . . . .Fuck Hans. ",
        "id": "5txid4",
        "score": 0,
        "title": "YEE HAWWW LETS ROUND UP ALL THEM DIRTY N-"
    },
    {
        "body": "The water level starts rising, but he has faith that God will save him. As the water is up to his knees, an old man in a rowboat sails up to him.\n\n\"Hey,\" he says. \"Need a lift?\"\n\nThe priest shakes his head. \"No thank you, I have faith that the lord will save me. Use your boat to find those more in need.\"\n\nThe rowboat heads off, and soon the water is up to the priest's chest.  A rescue boat loaded with supplies comes racing up to him.\n\n\"Grab my hand!\" the captain yells. \"We gotta get out of here!\"\n\n\"No!\" The priest yells. \"There are others who need help. I assure you, the lord will save me!\"\n\nReluctantly, the rescue boat rides off.\n\nAs the water continues to rise, the priest is forced to the roof of his house. A helicopter flies over to him and lowers a winch.\n\n\"Hold on!\" Shouts the winchman as he holds out his hand.\n\nBut the priest again shakes his head. \"No! The lord will save me! Go save someone else!\"\n\nFrustrated, the helicopter flies away. \n\nSadly, the water becomes too much for the priest to deal with and he goes under.\n\nHe finds himself in heaven, absolutely stunned. After going through the pearly gates, he walks straight up to God himself.\n\n\"Lord,\" the priest says, \"I spent my life devoted to you. I truly believed that you would protect me through the hardest times in my life. Yet when I needed you most, when my life was at stake, you weren't there for me!\"\n\n\"What are you talking about?\" God replies. \"I sent two boats and a fucking helicopter!!\"\n",
        "id": "5txhvu",
        "score": 20,
        "title": "A flood warning is given, but the local priest decides to stay..."
    },
    {
        "body": "They charged one and let the other off.",
        "id": "5txgny",
        "score": 1,
        "title": "Police arrested two guys in the riots. One for looting batteries, the other for throwing fireworks."
    },
    {
        "body": "Apparently chocolate is bad for dogs",
        "id": "5txepd",
        "score": 8,
        "title": "A bitch ate my cookie, now the bitch is dead"
    },
    {
        "body": "Yeah, they’re going to name it “The Trannies”",
        "id": "5txeab",
        "score": 0,
        "title": "Have you heard of the new LGBTQ Music Awards?"
    },
    {
        "body": "Joe bought a gun. He walked right into the sporting goods store, up to the gun counter, and picked out a semi-automatic .12 gauge shotgun with a box of buckshot shells. The entire process took no more than twenty minutes. \n\nJoe left town and drove for a couple hours before exiting the highway and driving down a winding county road for another ten minutes. Joe pulled into a service station and parked his car. He sat in his vehicle, loaded five shells into his new Benelli shotgun, and chambered in a shell.\n\nJoe clicked off the safety and walked into the convenience store. There was no one in sight but the attendant behind the counter. Her name was Janice. She tried to run when she saw the shotgun but Joe shot her as she turned. She took some buckshot to the brain and died almost instantly.\n\nJoe walked behind the counter, stepping carefully over Janice, picked up the phone, and dialed 911. \"I've killed a lady. I'm robbing the store,\" Joe told the 911 operator. He then emptied the cash register, walked out to his vehicle, and drove away. \n\nA short ways down the road, Joe came upon another service station. He pulled in and exited his vehicle. The owner of the service station was a capable man named Bill. Bill saw the look in Joe's eyes when Joe approached the door of the service station, and he saw the gun in his hand. Bill was ready with his own shotgun by the time Joe raised his, and Bill pumped a slug into Joe's abdomen.\n\nBill immediately called for an ambulance and approached Joe with compassion. \"Let me help you, son.\"\n\nAs Bill tended to Joe's wounds as best as he could, it became clear that Joe might not survive. Bill asked him, \"Why did you do it, son? Why did you bring that damn gun into my store? I had to shoot you. What, were you going to rob me? Why?\"\n\nAs the light of life flickered in Joe's eyes, with his dying breath he responded, \"Damn it all. Shamu and Moby Dick put me up to it. They are waiting outside for me right now. I'm gonna go get them. Be right back, mister.\"\n\nAnd with that, Joe died. Bill would go on to give a full account of Joe's actions and his last words to the police and to the press. Then, the following morning, the Sunday paper headline read,\n\n\"The Outlaw Joe Sees Whales\"",
        "id": "5txe5k",
        "score": 1,
        "title": "Joe bought a gun . . ."
    },
    {
        "body": "He woke me up late last night and asked if I could write a few gags for his set in a couple of days, because his mom just died and he was busy with her funeral. I agreed to help him out and asked if he had a topic in mind. \n\nHe said, sorry, I'm too upset to be thinking about chocolate right now.\n\nLooks like I'm going to need help.",
        "id": "5txdts",
        "score": 0,
        "title": "My pal is a comedian."
    },
    {
        "body": "To get to the udder side.",
        "id": "5txcdx",
        "score": 4,
        "title": "Why did the hungry baby calf cross the road?"
    },
    {
        "body": "for taking a leek in the vegetable aisle.",
        "id": "5txc36",
        "score": 4,
        "title": "I got kicked out of a grocery store..."
    },
    {
        "body": "Nice Tits.",
        "id": "5txbr9",
        "score": 3,
        "title": "What do you say to a Woman with no arms or legs?"
    },
    {
        "body": "A man and his wife were outside their house doing yardwork. The husband looked over at his wife bent over her flower bed and said \"ya know honey, I never really noticed how big your ass is. Why, I bet it's just as wide as the range on the grill.\" To prove his point, the man went and grabbed the tape measure out of his toolbox. First he measured the width of the grill then his wife's bottom. \"Yep, just as thought. It really is as big as the grill.\" The wife got offended and stormed back into the house.\n\nLater that night, laying in bed, the husband started feeling frisky. He put his arm around hia wife and said \"hey honey, what do ya say we fool around a little bit?\". The wife turned to face him and said \"Now why would I fire up this big ol' grill for one little weenie?\". \n",
        "id": "5txbj3",
        "score": 37,
        "title": "Measurements"
    },
    {
        "body": "Apparently it was more pussy than he could handle.",
        "id": "5txbgj",
        "score": 4,
        "title": "[NSFW] Did you hear about the guy whose house was overrun with cats?"
    },
    {
        "body": "I wish I could post it on different sub",
        "id": "5txbd0",
        "score": 47,
        "title": "I am going out with my valentine tonight"
    },
    {
        "body": "alt-zheimers",
        "id": "5txaon",
        "score": 3,
        "title": "I've been suffering from an extreme form of memory loss"
    },
    {
        "body": "The doctor asks him to drop his pants and examines him. \n\nThe man asks: \"Doc, does it look serious?\"\n\nThe doctor replies: \"Sorry to tell you, but it's just the tip of the iceberg.\"",
        "id": "5txagl",
        "score": 33,
        "title": "A distraught man goes to his doctor and says \"Doc, there's a piece of lettuce sticking out of my butt!\""
    },
    {
        "body": "Have you ever looked at your X and wondered Y?",
        "id": "5tx9do",
        "score": 18,
        "title": "Relationships are a lot like algebra."
    },
    {
        "body": "They used a cumin shield.",
        "id": "5tx93d",
        "score": 7,
        "title": "Did you hear about the hostage situation at the spice factory?"
    },
    {
        "body": "An Engineer dies and goes to hell. He's hot and miserable, so he decides to take action. The A/C has been busted for a long time, so he fixes it. Things cool down quickly.\n\nThe moving walkway motor jammed, so he un jams it. People can get from place to place more easily.\n\nThe TV was grainy and unclear, so he fixes the connection to the Satellite dish and now they get hundreds of high def channels.\n\nOne day, God decides to look down on Hell to see how his grand design is working out and notices that everyone is happy and enjoying umbrella drinks. He asks the Devil what's going on?\n\nThe Devil replies, \"Things are great down here since you sent us that engineer.\"\n\n\"What?? An engineer? I didn't send you one of those, that must have been a mistake. Send him back up right this minute.\"\n\nThe Devil responds, \"No way! We are going to keep our engineer. We like this guy.\"\n\nGod demands, \"If you don't send him to me immediately, I'll sue!\"\n\nThe Devil laughs. \"Where are you going to get a lawyer?\"\n\n",
        "id": "5tx8td",
        "score": 30,
        "title": "An Engineer Goes to Hell"
    },
    {
        "body": "You look for the fresh prints.",
        "id": "5tx887",
        "score": 4,
        "title": "How do you find Will Smith in the snow?"
    },
    {
        "body": "And got a candy apple.",
        "id": "5tx7rl",
        "score": 3,
        "title": "I first realized we were a poor family when on my birthday I asked for the new sweet iphone."
    },
    {
        "body": "\"It's Levi-O-sARRRRRRR\"",
        "id": "5tx7im",
        "score": 1,
        "title": "If Harry Potter were about pirates:"
    },
    {
        "body": "The American boasts, \"clearly the American government is better. You can go to the white house with a megaphone and yell 'Trump sucks!' and you wouldn't even be arrested.\"\nThe Chinese replied, \"what of it? You can go to Tiananmen square and yell 'Trump sucks!'  and you still wouldn't be arrested.\" ",
        "id": "5tx7di",
        "score": 7,
        "title": "An American and a Chinese were arguing about which government was better"
    },
    {
        "body": "I agreed and realised way later that included sex",
        "id": "5tx607",
        "score": 8,
        "title": "When m'y girlfriend said let's not bother and do nothing this year for valentine's day"
    },
    {
        "body": "But it's not that I'm a chainsmoker, it's just the COPD makes me walk really slow.",
        "id": "5tx604",
        "score": 7,
        "title": "It's hard to believe I can smoke five cigarettes on a two mile walk to work..."
    },
    {
        "body": "So I got her nothing.",
        "id": "5tx5ur",
        "score": 98,
        "title": "My wife told me \"For Valentine's Day, nothing would make me happier than a diamond necklace\""
    },
    {
        "body": "Hillaryous. ",
        "id": "5tx58b",
        "score": 1,
        "title": "US Politics are"
    },
    {
        "body": "Women = time • money\n\nTime is money \n\nWomen = money^2\n\nMoney is the root of all evil\n\nTherefore \n\nWomen = Evil",
        "id": "5tx4yx",
        "score": 8,
        "title": "Women are time and money"
    },
    {
        "body": "WWWAAAATTTAAAAr...",
        "id": "5tx4dz",
        "score": 0,
        "title": "What's a ninjas favorite drink?"
    },
    {
        "body": "The librarian says, \"so do you live in one of those little round houses?\n\nPecan says, in a nutshell, yeah!",
        "id": "5tx34v",
        "score": 6,
        "title": "A pecan walks into a library..."
    },
    {
        "body": "But now I'm just an air conditioner. ",
        "id": "5tx274",
        "score": 0,
        "title": "I used to be a fan..."
    },
    {
        "body": "I know this doesn't sound strange but it was a pack of 20 cards",
        "id": "5tx20x",
        "score": 2,
        "title": "I was looking for the perfect Valentine's Day card when something caught my eye. One of the cards said \"I love you and only you\""
    },
    {
        "body": "We're having two litters.",
        "id": "5tx1o9",
        "score": 2,
        "title": "My wife is very anti-kids and I finally got her to agree on how many kids we'll have"
    },
    {
        "body": "Right now he's negotiating for a better interest rate on Daylight Savings Time.",
        "id": "5tx1gz",
        "score": 4,
        "title": "Donald Trump makes the best deals."
    },
    {
        "body": "The first one says - it's windy.\n\nSecond one says - it's not Wednesday, it's Thursday. \n\nThird one says - yea, I'm thirsty too, we should buy something to drink. ",
        "id": "5tx0ba",
        "score": 0,
        "title": "3 old ladies are sitting on a bus"
    },
    {
        "body": "If she wears gloves, soccer jersey and cleats ",
        "id": "5tx0au",
        "score": 21,
        "title": "You know your girlfriends a keeper"
    },
    {
        "body": "I sidled up to the local drug dealer on the corner ...\n\ncan I get an ounce of cocaine?\n\nlook pal, I only sell grams!\n\nfuck it, give us an ounce of grams then!",
        "id": "5tx06v",
        "score": 2,
        "title": "I've never done drugs before."
    },
    {
        "body": "Crib death",
        "id": "5twzm5",
        "score": 0,
        "title": "Whats 12 inches long, purple and makes women scream in the middle of the night?"
    },
    {
        "body": "I'm having trouble working out all the kinks.",
        "id": "5twzc8",
        "score": 14,
        "title": "I need help writing a BDSM joke."
    },
    {
        "body": "Stevie Wonder answering the iron",
        "id": "5twxgc",
        "score": 12,
        "title": "Whats black and screams?"
    },
    {
        "body": "When he realized it just wasn't going to work out.",
        "id": "5twvwj",
        "score": 8,
        "title": "When did the man know it was time to dump his fat GF?"
    },
    {
        "body": "She chews before she swallows.",
        "id": "5twvdf",
        "score": 26,
        "title": "How do you know if you have a high sperm count?"
    },
    {
        "body": "and ended up fucking her dad... :/",
        "id": "5twvbp",
        "score": 5,
        "title": "So I'm dating this girl who has a twin sister, and one night I got confused"
    },
    {
        "body": "I’ve got genital warts soon you will too",
        "id": "5twvb3",
        "score": 4,
        "title": "Roses are red Violets are blue"
    },
    {
        "body": "They start to feel some light precipitation\n\n\n\"I think it's raining\" says the man\n\n\n\"No it's snowing\" replies the woman. \n\n\"How about we ask this communist officer here?\" \"He is always right\" exclaims the man. \n\"Officer Rudolph, is it raining or snowing?\" \n\n\n\"Definitely raining\" officer Rudolph replies before walking off. \n\nThe man turns to his wife and says. \n\n\"See? Rudolph the red knows rain, dear\"",
        "id": "5twufa",
        "score": 141,
        "title": "A couple are walking in St. Petersburg square on Christmas Eve."
    },
    {
        "body": "She couldn't name One ",
        "id": "5twu7y",
        "score": 3,
        "title": "My girlfriend doesn't know any Metallica songs"
    },
    {
        "body": "but it's not a very good one.",
        "id": "5twtj4",
        "score": 2,
        "title": "I have an inferiority complex"
    },
    {
        "body": "A family was at the dinner table.  \nThe son asked his Father: \"Dad, how many kinds of boobs are there??  \nSurprised, the father answered:\"Well, son, there are three kinds of Boobs\"  \n\"In her 20's, a women's boobs are like Melons, round and firm.\"  \n\"In her 30's to 40's, they are like Pears, still nice but hanging a bit.\"  \n\"After 50, they are like Onions.\"  \nSon: \"Onions??\"  \nFather: \"Yes, you see them and they make you cry.\"  \nThis made his Wife and Daughter Mad, so the Daughter asked her Mom: \"How many kinds of Penises are there?\"  \nThe Mother smiled and said,\"Well dear, a man goes through 3 phases.\"  \n\"In his 20's, his penis is like an Oak Tree, Mighty and Hard.\"  \n\"In his 30's and 40's, it is like a Birch, Flexible but Reliable.\"  \n\"After 50's, it is like a Christmas Tree.\"  \nDaughter: \"Christmas Tree??\"  \nMom: \"Yes, the Tree is Dead and the Balls are just For Decoration!!\"",
        "id": "5tws6c",
        "score": 25,
        "title": "Three types of boobs"
    },
    {
        "body": "You saw it. You saw it with your own two eyes.",
        "id": "5tws5q",
        "score": 6,
        "title": "You know how you can cut wood just by looking at it?"
    },
    {
        "body": "They're greeted warmly by the big pearly gates. The welcoming angel is holding a big bowl of water. He asks the first nun - have you ever touched a man's penis? \n\nThe first nun trembles and says yes, she touched a penis but only with her fingers. \n\nDip your fingers into the holy water and you will be pure, instructs the angel. The nun dips her fingers in the water and is allowed through the big pearly gates. \n\nThe angel turns to the second nun and asks - did you touch a man's penis?\n\nBefore she could answer, the third nun blurts out - eww, I'm not drinking that water after it goes up her ass!",
        "id": "5twrpv",
        "score": 21,
        "title": "3 nuns die and go to heaven..."
    },
    {
        "body": "The nurse walks up to the doctor and asks... Doc, what are you doing?  Doc says... I'm writing a prescription.  Nurse says, but you're holding your thermometer.  Doc looks at her and says God Damn it some asshole has my pen ",
        "id": "5twrk1",
        "score": 18,
        "title": "A nurse walks up to the Doctor"
    },
    {
        "body": "He was a seasoned Veteran",
        "id": "5twqzh",
        "score": 109,
        "title": "I met a Soldier that survived Mustard Gas and Pepper spray"
    },
    {
        "body": "She accidentally knocks her youngest son's jar of bb's into the brownie mix. She says \"oh it'll be alright\"\n\nSeveral hours after the brownies were done her youngest son comes to her with tears in his eyes and says \"Mommy, when I was using the restroom I was peeing and something hard came out.\" \nShe said \"Oh it was just a BB, you'll be alright.\"\n\nHalf an hour later she's cleaning and she hears sobbing coming from the bathroom, she sees her daughter and asks what's wrong. Her daughter says \"I think I have kidney stones.\" \nThe mom replies \"oh it was just a BB, you'll be alright.\"\n\nLater that night she hears her oldest son laughing and says \"Let me guess, you were peeing and a BB came out?\" \nHe says \"No I was beating off and shot the dog!\"",
        "id": "5twqm6",
        "score": 6,
        "title": "One snow day a mother is making brownies for her kids"
    },
    {
        "body": "A man is served whiskey on a flight.\n\nThe flight attendant asks the priest seated next to him, whether he would like a drink too?\n\nPriest: I would rather be raped by a dozen prostitutes than let liquor touch my lips\n\nThe man returns the drink saying: Me too, I didn't know we had a choice...",
        "id": "5twqis",
        "score": 5,
        "title": "A man is served whiskey on a flight"
    },
    {
        "body": "And he's approached by a Jewish man who is clearly very drunk and the Jewish man says to him, \"Hey, I just wanted to let you know, I still blame YOU for Pearl Harbor.\" \n\nAnd the Chinese man says, \"What are you even talking about, that was the Japanese, I'm Chinese.\" \n\nTo which the Jewish man replies, \"Chinese, Japanese, you all are the same to me.\" And he walks away. \n\nWell this upset the Chinese man a bit so he decided to get a few drinks in him to help him calm down and maybe forget about the incident altogether. \n\nAnd so the Chinese man proceeded to drink until the wedding was over and as he was walking out he saw the Jewish man who had upset him earlier and being as inebriated as he was he decided to say something. \n\nThe Chinese man goes to Jewish man, \"Hey Buddy, I just wanted to let you know that I still blame YOU for the Titanic.\" \n\n\"The Titanic?\" Said the Jewish man, \"What are you even talking about, that was an iceberg?\" \n\nAnd the Chinese man says with a smug smile on his face, \"Goldberg, iceberg, you're all the same to me.\" ",
        "id": "5twqfa",
        "score": 11,
        "title": "A Chinese man is at a wedding"
    },
    {
        "body": "Kick Donald Trump in the chin.",
        "id": "5twnq8",
        "score": 10,
        "title": "How do you castrate Vladimir Putin?"
    },
    {
        "body": "Because their Great Igloos melted.",
        "id": "5twna3",
        "score": 1,
        "title": "Why did the Ancient Egyptians build Great Pyramids?"
    },
    {
        "body": "KNOCKIN ON HEAVENS DOOOWUUUWAAAAAAA",
        "id": "5twly8",
        "score": 4,
        "title": "Knock knock"
    },
    {
        "body": "They have an affinity for bonds.",
        "id": "5twl6q",
        "score": 6,
        "title": "What type of investment do chemists prefer?"
    },
    {
        "body": "D J Trump: Fake News!",
        "id": "5twl2f",
        "score": 0,
        "title": "Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal."
    },
    {
        "body": "A Troglodyke!",
        "id": "5twk7e",
        "score": 4,
        "title": "What do you call a lesbian cavewoman?"
    },
    {
        "body": "Are you up for a little row-mance?",
        "id": "5twj6j",
        "score": 9,
        "title": "What did one boat say to the other?"
    },
    {
        "body": "A female student walks down the street of a college town. She had a stressful day and is dying to smoke a cigarette, but her lighter simply won't work. Then she notices a few young women hanging out on street corner. She's shy, but eventually works up a courage to approach them. Out of nervousness she blurts out: \n\n**Dear colleagues, I was wondering if you had a light?**\n\nOne of the women produces a lighter, and the student walks away, puffing away happily. The women watch her go, and finally one remarks: \n**Puts out once, and now we're \"colleagues\"...**\n\nLet the downvotes begin... ;)",
        "id": "5twhrn",
        "score": 1,
        "title": "Colleagues"
    },
    {
        "body": "He says it's a rigged erection ",
        "id": "5twh45",
        "score": 9,
        "title": "Trump is suing Male enhancement giant Viagra.."
    },
    {
        "body": "Pardon me.",
        "id": "5twgog",
        "score": 1,
        "title": "Michael Flynn bumps into Donald Trump"
    },
    {
        "body": "They're already over it.",
        "id": "5twghc",
        "score": 6,
        "title": "How do Mexicans feel about Trumps wall?"
    },
    {
        "body": "the American asks: did you come here to die\n\nthe Australian says back: no i came here yesterday ",
        "id": "5twg1j",
        "score": 28,
        "title": "an American and a Australian are in the trenches"
    },
    {
        "body": "\"No\".\n\nI thought not. It's not a story the jedi would tell you.",
        "id": "5twg0c",
        "score": 0,
        "title": "Did you ever hear the tragedy of Darth Plagueis The Wise?"
    },
    {
        "body": "Master race.",
        "id": "5twfqx",
        "score": 0,
        "title": "Communism."
    },
    {
        "body": "My wife walked in to the room when I was in the middle of a furious argument with our son. When he ran out of the room crying, I said to my wife, “God, I wish that I’d used a condom now.”\nMy wife was aghast and said, “What! You mean you wish that our son had never been born?”\n\nI said, “No, I’ve got his girlfriend pregnant.”",
        "id": "5twfn7",
        "score": 25,
        "title": "God, I wish that I’d used a condom now."
    },
    {
        "body": "I got them home, opened the box and thought... that's odd.",
        "id": "5twfi9",
        "score": 11,
        "title": "I bought a dozen cup-cakes from a bakery."
    },
    {
        "body": "He gets a tin of paint and puts it on the counter, then pays the cashier; the cashier asked if he'd like a bag for it.\n\nHe says: \"don't you worry, it's fine in the tin\"",
        "id": "5twfhz",
        "score": 1,
        "title": "An Irish man walks into a builders merchant"
    },
    {
        "body": "One day, as they are scouring the beaches for firewood, they come across an old oil lamp, washed ashore. The Swede picks it up and wipes it gently with his shirt sleeve, clearing the sand and the dirt. Out pops a spirit. The spirit says:\n\n\"I have been trapped inside that lamp for a millennium due to a magic spell. Finally I have been set free. As a token of my gratitude, I will grant you one wish each.\"\n\nThe Swede states that he is fed up with that little island and he would like to go back to Trelleborg. Poof, the Swede is gone. Next up is the Norwegian. He says: \"I agree. I want to go home too, back to Narvik.\" Poof, the Norwegian vanishes. Now only the Icelander is left. After some pondering, he makes his wish. \"It's too lonely out here all by myself. I want my friends back!\"",
        "id": "5twf3h",
        "score": 30,
        "title": "A Swede, an Icelander and a Norwegian end up shipwrecked on a deserted island."
    },
    {
        "body": "Now I just watch like nobody's dancing.",
        "id": "5twezr",
        "score": 2,
        "title": "I used to hate the ballet"
    },
    {
        "body": "He woke up. ",
        "id": "5twevg",
        "score": 9,
        "title": "Did you hear about the kidnapping in the park the other day?"
    },
    {
        "body": "I'd like to offer mickydolenzes to his family.\n",
        "id": "5tweor",
        "score": 2,
        "title": "After the death The Monkees' Davy Jones..."
    },
    {
        "body": "\"Great scotch!\"",
        "id": "5tweaw",
        "score": 0,
        "title": "What does Doc Brown say when he tastes good booze?"
    },
    {
        "body": "It's not hard...",
        "id": "5twdke",
        "score": 3,
        "title": "How do you find a blind guy at a nudist colony?"
    },
    {
        "body": "Donald Trump and Justin Trudeau were we discussing politics when Donald leans in close and says:\n\nDonald: You know Justin, if the US were a Dictatorship I would be a Dictator.\n\nJustin: Yea, I suppose so Donald.\n\nDonald: And you know if the US were a Monarchy I would be a Monarch.\n\nJustin: That's also true Don, but I hate to break it to you, the US is a Country.",
        "id": "5twdga",
        "score": 22,
        "title": "Trump & Trudeau"
    },
    {
        "body": "Tulips on an organ.",
        "id": "5twbjv",
        "score": 4,
        "title": "In honor of Valentine's Day - what's better than a rose on a piano?"
    },
    {
        "body": "Twin sisters just turned one hundred years old in St. Luke's Nursing Home and the editor of the Cambridge rag, \"The Cambridge Distorter,\" told a photographer to get over there and take the pictures of these 100 year old twin bitteys. \n\nOne of the twins was hard of hearing and the other could hear quite well. \n\nThe photographer asked them to sit on the sofa and the deaf one said to her twin, \"WHAT DID HE SAY?\" \n\nHe said, \"WE GOTTA SIT OVER THERE ON THE SOFA!\" said the other. \n\n\"Now get a little closer together,\" said the cameraman. \n\nAgain, \"WHAT DID HE SAY?\" \n\n\"HE SAYS SQUEEZE TOGETHER A LITTLE.\" So they wiggled up close to each other. \n\n\"Just hold on for a bit longer, I've got to focus a little,\" said the photographer. \n\nYet again, \"WHAT DID HE SAY?\" \n\n\"HE SAYS HE'S GONNA FOCUS!\" \n\nWith a big grin the deaf twin shouted out, \"OH MY GOD - BOTH OF US?\"",
        "id": "5twb5a",
        "score": 135,
        "title": "Twin sisters just turned 100 years old"
    },
    {
        "body": "That's just her way of getting two more dates out of you.",
        "id": "5twavt",
        "score": 0,
        "title": "Have you ever gone out on a first date and she tells you she never sleeps with anyone until at least the third date?"
    },
    {
        "body": "...is to not release your music in the same year as Adele.",
        "id": "5twa7n",
        "score": 3,
        "title": "As a musician, I've learned the best way to win a Grammy..."
    },
    {
        "body": "My parents keep telling me to get one.",
        "id": "5twa2k",
        "score": 9,
        "title": "Life is like a diploma"
    },
    {
        "body": "The infadeles ",
        "id": "5tw99s",
        "score": 1,
        "title": "What do you call Adele's groupies?"
    },
    {
        "body": "Piesexual!",
        "id": "5tw8w7",
        "score": 1,
        "title": "What do you call a person in love with a pie"
    },
    {
        "body": "Flashbacks",
        "id": "5tw83v",
        "score": 144,
        "title": "What do you get when you spell the word \"man\" backwards"
    },
    {
        "body": "Because she can't even",
        "id": "5tw7x9",
        "score": 0,
        "title": "Why did the white girl count by odds to ten?"
    },
    {
        "body": "Switzerland",
        "id": "5tw6uz",
        "score": 4,
        "title": "I found a place where the recycling rate is 52%"
    },
    {
        "body": "No manmade structure was designed to hold back that many liberal tears",
        "id": "5tw6jo",
        "score": 0,
        "title": "The Oroville dam catastrophe is Trump's fault"
    },
    {
        "body": "So people don't confuse them with feminists.",
        "id": "5tw682",
        "score": 62,
        "title": "Why do sumo wrestlers shave their legs?"
    },
    {
        "body": "C'mon bear!",
        "id": "5tw5fd",
        "score": 1,
        "title": "How do you encourage a bear to eat cheese?"
    },
    {
        "body": "Audi...",
        "id": "5tw53r",
        "score": 53,
        "title": "What'd the cowboy say when he walked into the German car dealership?"
    },
    {
        "body": "American, German and Bosnian guys compete who will fart out a wine bottle cap the furthest. American goes first, eats 1 bowl of beans and farts out the cap 5 feet. German goes next, eats a cauldron full of beans and farts the cap 17 meters. Bosnian goes last, eats 1 bean and farts. They couldn't find the cap and they give up. \n\nThe next day on the news:\n\n\"An UFO size of a wine bottle cap hits and kills a Japanese civilian!\"",
        "id": "5tw4ge",
        "score": 0,
        "title": "American, German and Bosnian guys compete..."
    },
    {
        "body": "I knocked on the door and asked if I could, the people just slammed the door in my face.  My parents can be so rude sometimes.",
        "id": "5tw3ri",
        "score": 5,
        "title": "I went to the house I grew up in and wanted to look around"
    },
    {
        "body": "Her students were pizzing her off.",
        "id": "5tw3kw",
        "score": 3,
        "title": "Why was the orchestra teacher angry?"
    },
    {
        "body": "When he comes back, his friend asks him how it went. He replies that it did not go well.\n\n\"What happened?\" his friend asked.\n\n\"Well, since I didn't know hebrew, I decided to convey the ad through a comic. The first panel showed a guy in a desert, dying of thirst. The secone panel showed him drinking coke. And the third panel showed him completely rejuvenated.\"\n\n\"That sounds great! Why didn't it work?\"\n\n\"Nobody told me they read right to left!\"",
        "id": "5tw341",
        "score": 58,
        "title": "An advertiser for coke is dispatched to Israel"
    },
    {
        "body": "1.) The 1st semester",
        "id": "5tw2sc",
        "score": 9,
        "title": "I just finished the first semester in college and here is a list of things I failed at:"
    },
    {
        "body": "They ended up with an antoinette loss!",
        "id": "5tw2nx",
        "score": 0,
        "title": "Did you hear about the bakery that spent too much on cakes?"
    },
    {
        "body": "I couldn't understand where that came from, so I asked people. \"It's because you like both dogs and cats\" said my boyfriend. \"No, no, no. It's because she likes both tea and coffee\" said my girlfriend.",
        "id": "5tw1yr",
        "score": 3,
        "title": "My mother said that I'm indecisive"
    },
    {
        "body": "She was born a red head.",
        "id": "5tw1ou",
        "score": 0,
        "title": "Please pray for my daughter's soul"
    },
    {
        "body": "Right where you left it. \n\n\nI'm sorry. \n\n\nMy mom taught me that joke and told me that every birthday and it's my birthday today. ",
        "id": "5tvzwx",
        "score": 1,
        "title": "Where do you find a dog with no legs?"
    },
    {
        "body": "Just Tin",
        "id": "5tvzv8",
        "score": 0,
        "title": "What's Trump's least favorite periodic element?"
    },
    {
        "body": "Interviewer: How much milk do these cows give?\n\nFarmer: Which one? The Black ones or the brown ones?\n\nInterviewer: Brown ones.\n\nFarmer: A couple of litres per day.\n\nInterviewer: And the black ones?\n\nFarmer: A couple of litres per day.\n\nInterviewer(naturally a bit flummoxed): I see. What do you give them to eat?\n\nFarmer: Which ones? Black or brown?\n\nInterviewer: Black.\n\nFarmer: It eats grass.\n\nInterviewer: And the other ones?\n\nFarmer: Grass.\n\nInterviewer(now annoyed) : Why do you keep asking which one when the answers are the same?!\n\nFarmer: Because the black ones are mine.\n\nInterviewer: Oh, and the brown ones?\n\nFarmer: they are also mine",
        "id": "5tvzt7",
        "score": 30,
        "title": "An interviewer asks a shepard"
    },
    {
        "body": "Me: \"Then what happened? Did you decide not to give a fuck??\"",
        "id": "5tvzpi",
        "score": 0,
        "title": "Jon: walks out from the bathroom- \"Hey man sorry I took so long, I was just fixing my hair\""
    },
    {
        "body": "It was a lawyer.\nEdit: The last human on Earth.",
        "id": "5tvz7t",
        "score": 2,
        "title": "The last man sat in a room. There was a knock at the door..."
    },
    {
        "body": "If you can get honor.\nStay honor.\n\nBut if you can't come in her,\nCome honor.\n\nFor honor!!",
        "id": "5tvz4m",
        "score": 0,
        "title": "I would like to propose a toast! For honor..."
    },
    {
        "body": "He asks for a cabbage pie.\n\nBear tells him they don't have that kind of pie.\n\nIt repeats for a few days. Bear takes pity on Bunny and tells his wife, who does the baking:\n\n>Please, bake a cabbage pie for Bunny. He comes in every day asking for it.\n\nSo the next day, Bunny is there again.\n\n>Do you have a cabbage pie?\n\n&nbsp;\n\n>Yeah, we do!\n\n&nbsp;\n\n>It's just gross, right?",
        "id": "5tvyh7",
        "score": 1,
        "title": "Bunny comes to Bear's bakery..."
    },
    {
        "body": "All the way to boys size 12. ",
        "id": "5tvw0h",
        "score": 3,
        "title": "How deep do the Sandusky genes run?"
    },
    {
        "body": "She tried to use politics to determine if a vector field was conservative.",
        "id": "5tvvzo",
        "score": 1,
        "title": "Yo mamma's so stupid"
    },
    {
        "body": "He's a real Dong Wong. \n\nI'll just show myself out...",
        "id": "5tvvhg",
        "score": 0,
        "title": "My wife left me after being seduced by an Asian guy."
    },
    {
        "body": "One is the ace of spades, the other is the space of aids.",
        "id": "5tvups",
        "score": 13,
        "title": "What's the difference between a playing card and Africa?"
    },
    {
        "body": "They don't want the D",
        "id": "5tvtxs",
        "score": 0,
        "title": "What do all women at the womens marches have in common?"
    },
    {
        "body": "At the top of the Empire State Building, when the first man turns to the other and says \"You know, last week I discovered that if you jump from the top of this building, the winds around the building are so intense that by the time you fall to the 10th floor, they carry you around the building and back into a window\". The bartender just shakes his head in disapproval while wiping the bar.\n\nThe second guy says, \"What, are you nuts? There's no way that could happen. \"No, its true,\" the first man says. \"Let me prove it to you.\" He gets up from the bar, jumps over the balcony, and plummets toward the street below. As he nears the 10th floor, the high winds whip him around the building and back into the 10th floor window and he takes the elevator back up to the bar.\n\nHe meets the second man, who looks quite astonished. \"You know, I saw that with my own eyes, but that must have been a one time fluke.\" \"No, I'll prove it again,\" says the first man as he jumps again. Just as he is hurtling toward the street, the 10th floor wind gently carries him around the building and into the window. Once upstairs he urges his fellow drinker to try it.\n\"Well, why not.\" the second guy says, \"It works. I'll try it.\" He jumps over the balcony, plunges downward passes the 11th, 10th 9th, 8th, floors. . . . . and hits the sidewalk with a SPLAT.\nBack upstairs the bartender turns to the other drinker and says, \"You know Superman, you're a real jerk when you're drunk\".",
        "id": "5tvtlu",
        "score": 39,
        "title": "Two men are sitting drinking at a bar"
    },
    {
        "body": "Fish & Ships",
        "id": "5tvtfb",
        "score": 9,
        "title": "What's the seamonster's favourite meal?"
    },
    {
        "body": "They're making headlines",
        "id": "5tvt4u",
        "score": 0,
        "title": "Have you heard the news about corduroy pillows?"
    },
    {
        "body": "On the one hand, I support it because it's killing babies. On the other hand, it gives women a choice.",
        "id": "5tvslu",
        "score": 12,
        "title": "I'm really torn on abortions..."
    },
    {
        "body": "Dihydrogen monoxide now covers 70% of Earth. ",
        "id": "5tvse3",
        "score": 1,
        "title": "The environment is so bad."
    },
    {
        "body": "Cancer!",
        "id": "5tvr0w",
        "score": 2,
        "title": "How do you get stuck bubble gum out of your hair?"
    },
    {
        "body": "....dear dear old man ",
        "id": "5tvq8n",
        "score": 1,
        "title": "I ran over a Deer...."
    },
    {
        "body": "I need to mark my colander. ",
        "id": "5tvpqd",
        "score": 2,
        "title": "When is pasta month?"
    },
    {
        "body": "Tits very annoying",
        "id": "5tvp3n",
        "score": 3,
        "title": "I hate when people misuse \"it's\" and \"its\""
    },
    {
        "body": "Or so I've been told",
        "id": "5tvol1",
        "score": 10,
        "title": "TIL: 80% of people will believe a fact if it has a percentage in it"
    },
    {
        "body": "Sorry, wrong bus.",
        "id": "5tvnft",
        "score": 12,
        "title": "TIFU by being dyslexic and kidnapping 42 people"
    },
    {
        "body": "A married Irishman went into the confessional and said to his priest,\n\n'I almost had an affair with another woman.'\n\nThe priest said, 'What do you mean, almost?'\n\nThe Irishman said, 'Well, we got undressed and rubbed together, but then I stopped.'\n\nThe priest said, 'Rubbing together is the same as putting it in.  You're not to see that woman again. For your penance, say five Hail Mary's and put $50 in the poor box.'\n\nThe Irishman left the confessional, said his prayers, and then walked over to the poor box.\n\nHe paused for a moment and then started to leave.\n\nThe priest, who was watching, quickly ran over to him saying, 'I saw that. You didn't put any money in the poor box!'\n\nThe Irishman replied, 'Yeah, but I rubbed the $50 on the box, and\naccording to you, that's the same as putting it in!'",
        "id": "5tvmme",
        "score": 17972,
        "title": "Putting it in."
    },
    {
        "body": "A Brick.",
        "id": "5tvmis",
        "score": 7,
        "title": "What's red and bad for your teeth?"
    },
    {
        "body": "that nobody loves you on any other day of the year, and valentine's day shouldn't be any different.",
        "id": "5tvmfk",
        "score": 2666,
        "title": "If any of you are sad about being alone on valentines day, just remember..."
    },
    {
        "body": "Because it has a terabyte.",
        "id": "5tvm3a",
        "score": 0,
        "title": "Why is everyone scared of my hard drive?"
    },
    {
        "body": "*Tyrannosaurus Wrecks*",
        "id": "5tvlt0",
        "score": 6,
        "title": "What was the most destructive dinosaur of the prehistoric era?"
    },
    {
        "body": "Always remain in-touch with the community.  ",
        "id": "5tvkx8",
        "score": 1,
        "title": "What advice did the family therapist give to Jerry Sandusky Jr.?"
    },
    {
        "body": "\"My love for you is like these flowers and this ring. It's gonna wither and die by the end of the month and is also insanely overvalued.\"",
        "id": "5tvk5h",
        "score": 13,
        "title": "Tomorrow, I'm going to go to my girlfriend, get on one knee, present flowers and a ring, and say..."
    },
    {
        "body": "Because he pitched a tent whenever he saw one...",
        "id": "5tvk0u",
        "score": 2,
        "title": "How did you know that the exterminator was attracted to termites?"
    },
    {
        "body": "If it's not, you better check the connections on the back, or call a maintenance guy. Hopefully you didn't lose power. I'd make sure to get it figured out soon so your food doesn't go bad.",
        "id": "5tvjxp",
        "score": 0,
        "title": "Is your refrigerator running?"
    },
    {
        "body": "I wonder why Hitler haven't been invited to a Epsorts event yet. His KD ratio was 6,000,000 to 1.",
        "id": "5tvjoa",
        "score": 11,
        "title": "Why isn't Hitler playing in Esports?"
    },
    {
        "body": "But I think I'm gonna wait until someone else posts it here first though...",
        "id": "5tvjcr",
        "score": 7,
        "title": "I might've just wrote the greatest joke of all time."
    },
    {
        "body": "Great Reposte no counterplay.",
        "id": "5tviq8",
        "score": 0,
        "title": "Why is Fiora always banned?"
    },
    {
        "body": "A good friend told me a story once. When she was a kid her family would often go to zoos and museums while on vacation. They were in the aviary on one of those visits looking at birds. My friend saw a crow asked the zookeeper a question. \n\n\"What's the difference between a raven and a crow?\" \n\nThe zookeeper looked at her, smiled and started to answer. \n\n\"Have you ever heard of a pinion feather?\" he said. \"Pinions are the the feathers at the tip of a bird's wing that allows it to fly. They are also the ones that people will trim to prevent birds from flying away. Crows have 5 pinion feathers while ravens have 6. So, if you think about it, it's really just a matter of a pinion.\" \n\nTo this day, my friend and her family don't know the real answer to \"What's the difference between a crow and a raven?\"  ",
        "id": "5tvhzw",
        "score": 10,
        "title": "Ravens and Crows"
    },
    {
        "body": "As he carries his heavy suitcase, a Russian woman comes up to him with a whiskey bottle in her hand and says, \"I'll jerk your dick while you chug this, deal?\"\n\nThe man, not even thinking about the situation, agrees instantly and they rush off to the restroom, find a stall, and start doing it. While being jerked, he caps of the whisky bottle and starts chugging. A moment after, he starts feeling funny and dozes off to sleep. He wakes up, unknown of the time that has passed, and looks down only to realize his pants and underwear is gone, including his suitcase.\n\nHorrified, he runs out of the restroom, his thong going everywhere and 'bout, and yells,\n\n \"Help! Help! I've been jacked!\"",
        "id": "5tvhcr",
        "score": 0,
        "title": "A government man is walking his way to work..."
    },
    {
        "body": "No, but April may.",
        "id": "5tvh1j",
        "score": 8,
        "title": "Can February march???"
    },
    {
        "body": "Cancer.",
        "id": "5tvezi",
        "score": 0,
        "title": "What's the best way to get bubblegum out of your hair?"
    },
    {
        "body": "A rebel without a Claus.",
        "id": "5tvei0",
        "score": 2,
        "title": "What do you call her when St. Nick's wife dumps him to join a biker gang?"
    },
    {
        "body": "... and you have a nice personality and a beautiful smile \n\nGirl: you just wanna get into my pants\n\nBoy: you're intelligent as well.",
        "id": "5tvedl",
        "score": 37,
        "title": "You're a very beautiful girl"
    },
    {
        "body": "Opposites attract",
        "id": "5tvdz8",
        "score": 13,
        "title": "Why are women attracted to intelligent men?"
    },
    {
        "body": "It all started when my dad used to tuck me in at night.",
        "id": "5tvdu5",
        "score": 8,
        "title": "I'm obsessed with pushing my penis between my legs and pretending I'm a woman."
    },
    {
        "body": "Because a bird in the hand is worth two in the bush.",
        "id": "5tvcw2",
        "score": 2,
        "title": "Why should you always use your middle finger on a woman?"
    },
    {
        "body": "Then it really grew on me.",
        "id": "5tvcvp",
        "score": 2,
        "title": "I didnt like my beard at first"
    },
    {
        "body": "because I want to SmAsH",
        "id": "5tvcn9",
        "score": 0,
        "title": "Are you Samarium, Arsenic, and Hydrogen?"
    },
    {
        "body": "Spitfire ",
        "id": "5tv8xf",
        "score": 6,
        "title": "What kind of planes do rappers fly?"
    },
    {
        "body": "Aliens finally arrive on earth, and they're just as social as we are.  They meet with the human delegation and have a lovely chat, talking about how each species eats and sleeps and so on. \"Really! you guys put food in your face hole and throw away any leftovers. We just lay on it and absorb what we need.\" Stuff like that.  The topic turns to procreation and both delegations admit they're curious and that a demonstration would be probably be best.  The aliens go first. One hops on another's head, starts spinning and after ten minutes or so a tiny new alien falls to the ground, dusts itself off and politely asks for sustenance.  Then it's our turn.  The two volunteers come out and after a couple minutes they've finished (at least one of them has).  The aliens stand there for a moment before one leans over and shyly and asks, \"so, uh, where's the new human?\" The humans reply, \"oh, it'll be here in about 9 months.\" The alien asks \"Then what was the rush at the end for?\"  \n\n\nThe woman looks into the camera and says \"Amen!\" as the studio audience bursts into laughter and the credits roll.",
        "id": "5tv7lx",
        "score": 0,
        "title": "Aliens come to earth, and they're friendly! [NSFW]"
    },
    {
        "body": "Reddit  : \" I am married and i have many childs (SubReddits) \"",
        "id": "5tv5k2",
        "score": 0,
        "title": "Me: (To Reddit) will you be my valentine ???"
    },
    {
        "body": "But he did not know about it and his family did. They were afraid that if they told him he would have a heart attack, so they chose his favourite brother Ted to tell him easily.\n\"If you won 20 million dollars, what would you do with them?\" Said Ted.\n\"I would give you half of them\" said Jeff.\n\nToday is Ted`s funeral.\n",
        "id": "5tv545",
        "score": 2,
        "title": "Jeff won 20 million dollars"
    },
    {
        "body": "Teacher asks Johnny:\n\n\"Imagine you have $200. And you give $50 to Jane, $50 to Suzi, $50 to Melissa. What would you have?\"\n\n\"An orgy?\"\n\nEdited: names spelling, grammar.",
        "id": "5tv498",
        "score": 81,
        "title": "Math class"
    },
    {
        "body": "They sbread apart through mitoastis",
        "id": "5tv41j",
        "score": 14,
        "title": "How do bread cells divide?"
    },
    {
        "body": "I just can't do this anymore. I think I'm just going to kill myself.\nBut the gun is like... way over there.",
        "id": "5tv3yv",
        "score": 1,
        "title": "Everyones keeps teasing me about being so damn lazy"
    },
    {
        "body": "It's funny cause it's true.",
        "id": "5tv3wa",
        "score": 0,
        "title": "!false"
    },
    {
        "body": "Zero.",
        "id": "5tv36i",
        "score": 22,
        "title": "How many potatoes does it take to kill an Irishman?"
    },
    {
        "body": "I know, I don't get it either. ",
        "id": "5tv286",
        "score": 3,
        "title": "Sex"
    },
    {
        "body": "It was never fired and only dropped once.",
        "id": "5tv0pn",
        "score": 7,
        "title": "I'm selling an authentic French rifle.."
    },
    {
        "body": "The theives took a large soda and two bags of popcorn",
        "id": "5tuztc",
        "score": 724,
        "title": "Breaking News: A movie theatre has just been robbed of over two thousand dollars"
    },
    {
        "body": "Marriage-you-wanna?",
        "id": "5tuzkp",
        "score": 11,
        "title": "How to properly propose to a stoner"
    },
    {
        "body": "Two race conditions walk into a bar.",
        "id": "5tuywc",
        "score": 1,
        "title": "The bartender asks the first one \"What can I get you?\""
    },
    {
        "body": "Two gay men are having sex in bedroom. After a while one of them decides that he needs a break and goes to bathroom. The second one thinks he's away for too long so he goes to check him. When he finds him in bathroom, whole room is covered with semen.  He asks with anger: 'Why didn't you wait for me?!' but second one sort of surprised answers: 'Oh you mean  that? I just farted....' ",
        "id": "5tuysg",
        "score": 0,
        "title": "Two gay men in are having sex....."
    },
    {
        "body": "To pee or not to pee.\n",
        "id": "5tuy8f",
        "score": 0,
        "title": "What did the pea wonder before an 8 hour road trip?"
    },
    {
        "body": "Because he couldn't control his pupils.",
        "id": "5tuxbl",
        "score": 4,
        "title": "Why was the teacher cross eyed?"
    },
    {
        "body": "2.71828 √(-1) 2.71828 √(-1) (5-5)",
        "id": "5tuxa3",
        "score": 352,
        "title": "Old McDonald had a farm..."
    },
    {
        "body": "Upper management says, they caught him stealing \"dough\". ",
        "id": "5tuwy5",
        "score": 1,
        "title": "Manager gets caught stealing from his pizza job."
    },
    {
        "body": "A boo bee",
        "id": "5tuvep",
        "score": 5,
        "title": "What kind of bee produces milk instead of honey?"
    },
    {
        "body": "So he could win Allah the prizes.",
        "id": "5tuu4o",
        "score": 7,
        "title": "Why did the muslim guy rig a competition?"
    },
    {
        "body": "An ottometrist",
        "id": "5tuu3i",
        "score": 1,
        "title": "What do you call a doctor named Otto?"
    },
    {
        "body": "Happy Wallentine's Day.",
        "id": "5tutkq",
        "score": 0,
        "title": "Donald Trump's greeting to all Mexicans on 14th February."
    },
    {
        "body": "Gravity",
        "id": "5tusy1",
        "score": 0,
        "title": "Why were the Vandals so fat?"
    },
    {
        "body": "Then the humans will suspect nothing!",
        "id": "5tuswx",
        "score": 2,
        "title": "If it walks like a duck, talks like a duck, and looks like a duck..."
    },
    {
        "body": "Try Snickers sometimes",
        "id": "5tuspr",
        "score": 0,
        "title": "What is the difference between Snickers and a dick?"
    },
    {
        "body": "It's been a hard time for us.",
        "id": "5tusk0",
        "score": 12,
        "title": "My father died from an overdose of Viagra recently."
    },
    {
        "body": "My wife tried to come to America, but thanks to trump chicken not get in.",
        "id": "5tuqfk",
        "score": 2,
        "title": "Mexican word of the day: Chicken"
    },
    {
        "body": "Then duck on over here and get some.",
        "id": "5tupjq",
        "score": 0,
        "title": "Do you like duck sausage?"
    },
    {
        "body": "Troops",
        "id": "5tuond",
        "score": 52,
        "title": "What's the United States' biggest, most well-known export?"
    },
    {
        "body": "Turns out, all it does is just change the color of the baby. ",
        "id": "5tuntg",
        "score": 9318,
        "title": "I thought a vasectomy wouldn't get my wife pregnant.."
    },
    {
        "body": "It's very handy!",
        "id": "5tunql",
        "score": 21,
        "title": "I learned sign language"
    },
    {
        "body": "Or is it just because I'm Jewish?",
        "id": "5tumj3",
        "score": 2,
        "title": "Does anyone else get as excited about Valentine's Day coming up as they do about Christmas?"
    },
    {
        "body": "Numbers that aren't divisible by two.﻿",
        "id": "5tume2",
        "score": 15,
        "title": "You know what's really odd?"
    },
    {
        "body": "\"I mean I've seen millions of these \"Free Wifi\" -signs through the years, but as far as I know, the poor bastard hasn't been freed yet!\"",
        "id": "5tumbp",
        "score": 0,
        "title": "My grandpa said to me: \"I don't think these \"Free (someone)\" things are working...\""
    },
    {
        "body": "A monkey is sitting in a tree smoking a joint when a lizard walks past, looks up and says to the monkey\n\n \"Hey, what're you doing?\"\n\nThe monkey replies, \"Smokin' a joint, come up and have some.\"\n\nSo the lizard climbs up and sits next to the monkey and they smoke a few joints.\n\nAfter a while the lizard says his mouth is 'dry' and he's going to get a drink from the river.\n\nThe lizard is so stoned that he leans over too far and falls into the river.\n\nA crocodile sees this and swims over to the lizard and helps him to the side, then asks the lizard, \"What's the matter with you?\"\n\nThe lizard explains to the crocodile that he was sitting up a tree with a monkey smoking pot, got too stoned and then fell into the river while taking a drink.\n\nThe crocodile says he has to check this out and wanders into the jungle. He finds the tree where the monkey is sitting finishing up a joint.\n\nThe crocodile yells up to the monkey and says \"Hey!\"\n\nThe monkey looks down and says, \"Fuck man! How much water did you drink?!?\"",
        "id": "5tulqd",
        "score": 451,
        "title": "A monkey is getting stoned in a tree.."
    },
    {
        "body": "Silicone Valley",
        "id": "5tullq",
        "score": 20,
        "title": "What do you call the cleavage of a woman with fake breasts?"
    },
    {
        "body": "I asked an old man, \"Even after 95 years, you still call your wife 'Darling', 'Honey', 'Love'. What's the secret?\" . OLD MAN: \"I forgot her name 10 years ago and I'm scared to ask her",
        "id": "5tukgs",
        "score": 18,
        "title": "I asked an old man, \"Even after 95 years, you still call your wife 'Darling', 'Honey', 'Love'. What's the secret?\""
    },
    {
        "body": "One hand on the steering wheel, the other on the road ",
        "id": "5tuk5x",
        "score": 1,
        "title": "How does Hellen Keller drive?"
    },
    {
        "body": "So much so, even their scandals are Russian.",
        "id": "5tujua",
        "score": 1,
        "title": "This administration is doing everything they can as quickly as possible"
    },
    {
        "body": "Hay HAY Hay",
        "id": "5tuiq5",
        "score": 0,
        "title": "What did the gay horse eat for brunch?"
    },
    {
        "body": "You're always going to be satisfied with the job.",
        "id": "5tugln",
        "score": 0,
        "title": "There's one good thing about being a porn star."
    },
    {
        "body": "Closing their blinds, locking their doors, calling the police...",
        "id": "5tug0u",
        "score": 25,
        "title": "Some women love playing hard to get."
    },
    {
        "body": "I always blame the Nazis.\n\n",
        "id": "5tufw5",
        "score": 0,
        "title": "I hate it when it heils outside..."
    },
    {
        "body": "Amy: Truth or dare?\n\nLingling: Truth.\n\nAmy: Where's Sarah's dog?\n\nLingling: Dare.\n\n\n\n**lmao this is old asf and i am in no way racist, this just made me laugh**",
        "id": "5tuf3t",
        "score": 1,
        "title": "A Girls Sleepover"
    },
    {
        "body": "I can't believe she's not better.",
        "id": "5tuey8",
        "score": 1,
        "title": "My aunt Marge has been in hospital for a while."
    },
    {
        "body": "Mr and Mrs Sterile have no children.",
        "id": "5tudi7",
        "score": 3,
        "title": "Mr and Mrs.."
    },
    {
        "body": "They never bothered with the \"Y\". ",
        "id": "5tudfa",
        "score": 0,
        "title": "Why are women so clueless?"
    },
    {
        "body": "A man stands, chain smoking at a bus stop.\n\nThe woman standing next to him says \"Hey, don't you know that those things can kill you? I mean, didn't you see the giant warning on the box?!\"\n\n\"That's OK...\" says the guy, puffing casually, \"I'm a programmer\"\n\n\"So? What's that got to do with anything?\"\n\n\"Errors are serious, warnings are nothing...\".",
        "id": "5tuddt",
        "score": 31,
        "title": "A man stands, chain smoking at a bus stop..."
    },
    {
        "body": "It probably identifies as a napkin and how dare you assume it's species. ",
        "id": "5tudbs",
        "score": 627,
        "title": "If it looks like a duck, and sounds like a duck..."
    },
    {
        "body": "They cried until the Oroville dam collapsed.",
        "id": "5tud7p",
        "score": 14,
        "title": "Californians hate walls so much..."
    },
    {
        "body": "He found out how a Mercedes bends.",
        "id": "5tud6j",
        "score": 46,
        "title": "A man drove his car into a tree."
    },
    {
        "body": "So, I was talking to my friend the other day, and we ended up talking about our local deli.\n\n&nbsp;\n\nI asked him what his favorite sandwich was, and he told me it was the pastrami salami sandwich.\n\n&nbsp;\n\nThen I said \"I don't remember that one. What's on it exactly?\"\n\n&nbsp;\n\nHe said \"It's the one with the synthetic pork and lard sausage.\"\n\n&nbsp;\n\nI said \"No, you're thinking of the phony bologna sandwich.\"",
        "id": "5tud5j",
        "score": 0,
        "title": "Favorite sandwich"
    },
    {
        "body": "/r/Jokes",
        "id": "5tuck5",
        "score": 657,
        "title": "I found a place where the recycling rate is 98%"
    },
    {
        "body": "But NaH",
        "id": "5tua38",
        "score": 28,
        "title": "I wanted to make a joke about chemistry tests"
    },
    {
        "body": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them \"dam fish.\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the fucking potatoes!\"",
        "id": "5tu968",
        "score": 24,
        "title": "Pass the dam fish!"
    },
    {
        "body": "Stay oveerrr there ",
        "id": "5tu8n8",
        "score": 0,
        "title": "What did scorpion say to your ugly mum"
    },
    {
        "body": "Non existent, but I hope every day.\n\n",
        "id": "5tu89x",
        "score": 6,
        "title": "Finding the perfect shower temperature on the first try is like my girlfriend"
    },
    {
        "body": "His hair is a mess, his family is nuts, his neighbour is an asshole, his best friend is a pussy and to top it all off, his owner beats him regularly.  ",
        "id": "5tu7s0",
        "score": 36,
        "title": "A dick has a sad life if you think about it"
    },
    {
        "body": "He just couldn't see himself doing it.",
        "id": "5tu744",
        "score": 3,
        "title": "Why did the invisible man quit his new job?"
    },
    {
        "body": "Emanuel Labor",
        "id": "5tu6tw",
        "score": 0,
        "title": "What do you call it when a Mexican provides hands-on internet services?"
    },
    {
        "body": "It's a no-ball cause. \n\n(But seriously you should)",
        "id": "5tu4wi",
        "score": 6,
        "title": "PSA: You should all donate money to testicular cancer research."
    },
    {
        "body": "Vinnie, my hitman, said he'd do it for me. ",
        "id": "5tu3fe",
        "score": 0,
        "title": "I'm a very busy businessman, but my wife still demanded that I take her out for valentine's day..."
    },
    {
        "body": "Every time I see someone racing their shopping cart down the parking lot I secretly hope they run into a car. Wham! ",
        "id": "5tu1ua",
        "score": 0,
        "title": "Shopping Cart racing"
    },
    {
        "body": "Joke's on them, I'm never letting them out of my basement.",
        "id": "5tu1sd",
        "score": 445,
        "title": "Jehovah's witnesses are always banging on my door everyday"
    },
    {
        "body": "Hillary Clinton.",
        "id": "5tu1g5",
        "score": 159,
        "title": "The choice for president came down to two candidates: the moody bitch or"
    },
    {
        "body": "It went into the kitchen and caused a stir.",
        "id": "5ttyvk",
        "score": 3,
        "title": "Did you hear about the troublesome teaspoon?"
    },
    {
        "body": "It was a thanqueue.",
        "id": "5ttyps",
        "score": 8,
        "title": "I was standing in line for hours showing my appreciation to everyone I met."
    },
    {
        "body": "I hope she likes her new weed eater! ",
        "id": "5ttyb7",
        "score": 2,
        "title": "I asked my wife what she wanted for Valentine's Day, and she said \"Something long and powerful that vibrates.\""
    },
    {
        "body": "Popcorn! ",
        "id": "5ttxvs",
        "score": 2,
        "title": "Who's the father of corny jokes?"
    },
    {
        "body": "Because Jewish women won't take anything that's less than 10% off",
        "id": "5ttxs9",
        "score": 25,
        "title": "Why are Jewish men usually circumcised?"
    },
    {
        "body": "CrazyRussianHacker.",
        "id": "5ttx02",
        "score": 15,
        "title": "Who is Trump's favorite YouTuber?"
    },
    {
        "body": "when they want something",
        "id": "5ttww6",
        "score": 2,
        "title": "My mum calls me Scott, but my friends call me"
    },
    {
        "body": "But I won't be suede",
        "id": "5ttwuc",
        "score": 4,
        "title": "My friend is trying to convince me to replace all my skin with a plush brown material"
    },
    {
        "body": "And wow, that sure is a work out, it really....gets the blood moving",
        "id": "5ttwmo",
        "score": 2,
        "title": "I was doing CPR the other day"
    },
    {
        "body": "That shit could spell disaster",
        "id": "5ttvi9",
        "score": 99,
        "title": "Never swallow scrabble tiles..."
    },
    {
        "body": "Re-ali",
        "id": "5ttvgk",
        "score": 1,
        "title": "What kind of tea is hard to swallow sometimes?"
    },
    {
        "body": "Mr. Sketch.",
        "id": "5ttuqh",
        "score": 6,
        "title": "What marker is only sold in shady areas?"
    },
    {
        "body": "She sends a text message to her husband.\n\nW - \"Hi honey, this is my new number. Can't wait to see you tonight\"\n\nM - \"Hey babe. I can't tonight. I'm having dinner with my wife\"",
        "id": "5ttulk",
        "score": 12,
        "title": "A woman gets a new number"
    },
    {
        "body": "They Aaarrrrrrrrrrtificially Inseminate. ",
        "id": "5ttsv3",
        "score": 1,
        "title": "How do pirates have babies?"
    },
    {
        "body": "As her husband was getting in; and she heard the door bell and quickly wrapped herself in a towel and went downstairs. She opened the door and it was their next door neighbor, Mike. He said, I'll give you eight hundred dollars if you drop that towel right now. She thought, well that's a lot of money, so she dropped the towel. He gave her the money and left. She went upstairs and told her husband that the neighbor Mike had come by. He asked if he gave her the eight hundred dollars he owed him.",
        "id": "5ttspq",
        "score": 45,
        "title": "A woman was getting out of the shower"
    },
    {
        "body": "The title says it all.",
        "id": "5ttpqx",
        "score": 0,
        "title": "it all"
    },
    {
        "body": "How was I supposed to know it was bad to trigger snowflakes!",
        "id": "5ttp8r",
        "score": 3,
        "title": "During science class at school, I lowered the pressure and temperature in my lab flask, and introduced some tiny ice crystals to it. But my tutor stopped me and sent me home for trolling."
    },
    {
        "body": "An angel ushers the Frenchman into a room filled with every French delicacy imaginable and instructs him - you can eat whatever you want, but if you eat anything from this table, at 5:00 a boiling pot of French onion soup will be wheeled in and you're going in it. \n\nThe Frenchman thinks for a moment and stands back in fear. \n\nAn angel ushers the Italian into a room filled with every Italian delicacy imaginable and instructs him - you can eat whatever you want, but if you eat anything from this table, at 5:00 a boiling pot of Minestrone soup will be wheeled in and you're going in it. \n\nThe Italian thinks for a moment and stands back in fear.\n\nAn angel ushers the Jewish man into a room filled with every type of Jewish delicacy imaginable and instructs him - you can eat whatever you want, but if you eat anything from this table, at 5:00 a boiling pot of chicken soup will be wheeled in and you're going in it. \n\nThe Jewish guy thinks for a moment and begins stuffing his face with food. \n\nThe puzzled angel has never seen this before. No one ever dared to eat the food in fear of being thrown into the boiling soup. He asked the Jewish fellow - I don't understand, the Frenchman and Italian were too scared to eat, are you not afraid?\n\nThe Jewish guy answered - nah, I know how these Jewish events work, 5:00 is never 5:00 and the soup is never that hot. ",
        "id": "5tto6p",
        "score": 220,
        "title": "A Frenchman, an Italian and a Jewish man die and go to heaven...."
    },
    {
        "body": "Iceland",
        "id": "5tto1g",
        "score": 186,
        "title": "Have you ever noticed that Ireland is just one sea away from...."
    },
    {
        "body": "So I bought her a helmet and some crayons.",
        "id": "5ttnko",
        "score": 1918,
        "title": "My wife said she wanted to feel special this Valentines Day."
    },
    {
        "body": "After all, work just comes and goes.",
        "id": "5ttniy",
        "score": 194,
        "title": "It must be hard working as a prostitute."
    },
    {
        "body": "Roses are red violets are blue I am pregnant but it is not from you",
        "id": "5ttn62",
        "score": 9,
        "title": "For the valentines spirit"
    },
    {
        "body": "in soviet russia, poems write you. ",
        "id": "5ttmst",
        "score": 9,
        "title": "roses are red, violets are blue"
    },
    {
        "body": "that's it. that's the joke. ",
        "id": "5ttmh7",
        "score": 0,
        "title": "my friends carter and jack"
    },
    {
        "body": "Scene: A conversation with my friend’s father, who knows I do \u2028Web design.\n\nFather: I have a business idea. How hard is it to make a Facebook?\n\nMe: Oh, very easy.\n\nFriend: He doesn’t mean to make \u2028a Facebook profile. He means to \u2028remake all of Facebook.\n\nMe: Oh. Very hard.\n\nFather: Oh, OK.",
        "id": "5ttmaz",
        "score": 0,
        "title": "Dad’s Brilliant Business Plan"
    },
    {
        "body": "In little Nazis!",
        "id": "5ttlm4",
        "score": 0,
        "title": "How did Anne Frank tie her shoes?"
    },
    {
        "body": "You should have seen the look on the cashier's face",
        "id": "5ttllh",
        "score": 19,
        "title": "I recently came into some money."
    },
    {
        "body": "I think she's addickted.",
        "id": "5ttlfx",
        "score": 1,
        "title": "My sister can't stop having sex."
    },
    {
        "body": "People who answer their own questions.",
        "id": "5ttla0",
        "score": 103,
        "title": "You know what I hate?"
    },
    {
        "body": "The supervisor couldn't believe it. He lost his shit. ",
        "id": "5ttkzg",
        "score": 88,
        "title": "The pathology lab was robbed last night. The stool samples were gone!"
    },
    {
        "body": "A Spynach",
        "id": "5ttkn5",
        "score": 2,
        "title": "How do you call a vegetarian spy?"
    },
    {
        "body": "Husband : What do you want for Valentine Day ??\n\nWife :  Give me One Ring, that's enough ..\n\nHusband : From Landline or Mobile ??",
        "id": "5ttk92",
        "score": 1,
        "title": "Valentine day gift"
    },
    {
        "body": "So I killed myself.",
        "id": "5ttjpf",
        "score": 47,
        "title": "When I went to pay for my items in a spiritualist shop I noticed a sign saying 'Queue on the other side'."
    },
    {
        "body": "1. Nice shirt.\n\n2. Wow. A second nice shirt.\n\n3. OK, first shirt again.\n\n4. He has two shirts.",
        "id": "5ttjel",
        "score": 9,
        "title": "What My Girlfriend Thought, First four Dates:"
    },
    {
        "body": "A: A quarter pounder with cheese.",
        "id": "5tthyn",
        "score": 15,
        "title": "Q: What do you call an anorexic with a yeast infection?"
    },
    {
        "body": "His darkness rubbed off on him\n",
        "id": "5ttgh4",
        "score": 0,
        "title": "Why was the pencil s bad influence on the paper ?"
    },
    {
        "body": "*Second airhorn sound*\n\nMe: \"Well this clearly isn't deodorant.\"",
        "id": "5ttfej",
        "score": 398,
        "title": "*Airhorn sound*"
    },
    {
        "body": "Numerous studies say that people who celebrate more birthdays live for longer",
        "id": "5ttej0",
        "score": 3,
        "title": "Celebrating birthdays is good"
    },
    {
        "body": "Suddenly he tripped and fell, spilling his contents all over the road. \n\nSensing no movement at all for quite some time, the road asked: \"Do you need some help so you can get up, cross the road and finish this joke?  What's wrong?\"\n\nThe salt replies: \"Freezing point depression.\"",
        "id": "5ttdr1",
        "score": 1,
        "title": "A bag of salt was crossing the road."
    },
    {
        "body": "You can't see them coming",
        "id": "5ttdm0",
        "score": 1,
        "title": "What's the best thing about John Cena jokes?"
    },
    {
        "body": "He offers Peter gold, thinking he can buy his way in. Peter looks at it and says, \"You brought me pavement?\"",
        "id": "5ttdbj",
        "score": 32,
        "title": "A rich guy dies and goes to the gates of heaven."
    },
    {
        "body": "At the grocery store.  I told her I would wait in the car.  What I didn't tell her was that I would move the car to the other end of the parking lot, and watch for her to come out.  \n\nSomething tells me that after 15 minutes of searching, she'll feel the same way I did in the dairy section.  Which butter is healthiest, she wondered, after reading the first 3 labels.  She's probably still reading them.  I can't wait to learn which one she'd chosen.",
        "id": "5ttbx5",
        "score": 0,
        "title": "I left my wife"
    },
    {
        "body": "Sometimes you get lucky, but most of the time you just lose your self esteem",
        "id": "5tta1e",
        "score": 70,
        "title": "Posting a joke on a Reddit is like going in a bar."
    },
    {
        "body": "Some geeky kid in the 80's forced it to.",
        "id": "5tt8k5",
        "score": 3,
        "title": "Why did the frog cross the road?"
    },
    {
        "body": "Doesn't matter you Reddit anyway.",
        "id": "5tt8bq",
        "score": 3,
        "title": "How Many Times is This Shit Going to Get Reposted?"
    },
    {
        "body": "An Englishman, an Irishman and a Scotsman are driving through a desert when their car breaks down. They decide they must walk across the desert. The Englishman takes an umbrella out of the boot and begins walking. The Irishman takes out his flask, fills it with whisky and follows the Englishman. The scot rips the door off the car and runs to catch up with the others. \n\nSometime later they come across an Arab caravan. A man walks up to them and says to the Englishman ‘Sahib, you know that it does not rain around these parts?’ The Englishman replies ‘Ah but you see it is not for the rain, it is for the sun.’ And so the Arab knew the Englishman was truly wise. He turns to the Irishman and says ‘You have a flask but it is not filled with water?’ ‘Well you see’ says the Irishman ‘water can be trouble around here so I filled it with something more precious instead.’ And so the Arab knew the Irishman was truly wise. ‘And you sir, for what reason do you carry the door?’ so the Scotsman says ‘Well I figure, if I get too hot I can just wind down the window.’\n\n\n*formatting",
        "id": "5tt805",
        "score": 60,
        "title": "An Englishman, an Irishman and a Scotsman are driving through a desert."
    },
    {
        "body": "when suddenly he sees a rain cloud approach. He doesn't want his animals getting soaked or they might end up cold. \n\nHe quickly scavenges for a bunch of branches and combines it with a tarp that he brought just for this occasion to build a make shift shelter. He whistles for his dog to herd them under the haphazard roof. He does a quick count and is shocked to find he suddenly has 30 cows. \n\nThe next day he brings his wife along with his cows. Without even waiting for rain he builds a canvas roof and herds all his cows inside and again his 26 cows turn into 30. But his wife is less than impressed. \n\n\"Don't you think that's amazing?!\" he asks her.\n\nThe Wife replies, \"It's just as expected, you rounded them up to the nearest tent.\"",
        "id": "5tt7cq",
        "score": 31,
        "title": "A farmer was letting his 26 cows graze on a field near his farm with his dog"
    },
    {
        "body": "He used the alternative fax.",
        "id": "5tt6nx",
        "score": 3,
        "title": "How did Trump avoid discovery when all of the main means of communication were being traced?"
    },
    {
        "body": "Cervical cancer. ",
        "id": "5tt6dg",
        "score": 591,
        "title": "What's black and eats pussy?"
    },
    {
        "body": "But I'd also like to get laid tomorrow night, so Walgreens after work it is.",
        "id": "5tt5wc",
        "score": 3,
        "title": "I'd like to think that my girlfriend and I have a relationship that is above being forced to buy simple gifts as part of a made up holiday that exploits working class people through the commercialism of enormous corporations"
    },
    {
        "body": "His subject matter is poorly executed.",
        "id": "5tt5qg",
        "score": 1,
        "title": "[NSFW] What does the South side of Chicago hate about their police chief?"
    },
    {
        "body": "...because they're originally from Bowling Green, and everyone was sorry for the loved ones they lost. ",
        "id": "5tt48v",
        "score": 2,
        "title": "Cage the Elephant only won the Grammy out of pity..."
    },
    {
        "body": "However, she kept running and didn't say anything to me. I shrugged and kept going, thinking that maybe she didn't hear me. About 10 minutes later, she caught up to me again, and I once more waved and said \"hola.\" Still, she kept her eyes straight ahead as she passed me and didn't respond. At this point, I was a little offended and felt determined to at least get a response of some kind from her.  \n\nFinally, about 10 minutes later she caught up to me again, and as she passed I said \"hola\" somewhat louder than before. She finally slowed down and turned back to me and said \"A few times I've been around this track, so it's not just gonna happen like that, 'cause I ain't no hola back girl!\"",
        "id": "5tt469",
        "score": 10,
        "title": "So I was jogging around the track at the gym and this really hot Latina chick passed me. I gave her a friendly wave and said \"hola.\""
    },
    {
        "body": "What the hellman! ",
        "id": "5tt3rx",
        "score": 11,
        "title": "I just dropped my phone in a load of mayo."
    },
    {
        "body": "An ISIS members' dick.",
        "id": "5tt2ru",
        "score": 343,
        "title": "What's the smallest organ in a goat?"
    },
    {
        "body": "\nNothing...just ice",
        "id": "5tt2lg",
        "score": 4,
        "title": "What's Batman's favorite drink?"
    },
    {
        "body": "How do you get 4 hookers on to one stool?\n\nTurn It upside down. ",
        "id": "5tt2bs",
        "score": 15,
        "title": "4 hookers"
    },
    {
        "body": "I started looking throughout the house, and when I turn a corner there's a guy standing on my timepiece, borderline groping and harassing a girl. So I go up and punch the guy, that's not gonna happen. Not on my watch. ",
        "id": "5tt1kn",
        "score": 4,
        "title": "I was at a party and I lost my watch"
    },
    {
        "body": "pornhub is down; your facebook will do",
        "id": "5tt1dp",
        "score": 99,
        "title": "roses are red, violets are blue,"
    },
    {
        "body": "I don't know, ask your other dad.",
        "id": "5tt17w",
        "score": 3,
        "title": "Dad, Am I adopted ?"
    },
    {
        "body": "Unless everyone gets them ",
        "id": "5tszzo",
        "score": 31,
        "title": "Communism jokes aren't funny"
    },
    {
        "body": "Apparently, he has a huge apartment complex.",
        "id": "5tszwx",
        "score": 2,
        "title": "American Billionaire Grant Cardone is seeing a top psychiatrist."
    },
    {
        "body": "A man escapes from prison where he has been for 15 years. He breaks into a house to look for money and guns and finds a young couple in bed. \n\nHe orders the guy out of bed and ties him to a chair, while tying the girl to the bed he gets on top of her, kisses her neck, then gets up and goes into the bathroom. While he's in there, the husband tells his wife:\n\n\"Listen, this guy's an escaped convict, look at his clothes! He probably spent lots of time in jail and hasn't seen a woman in years. I saw how he kissed your neck.\" If he wants sex, don't resist, don't complain, do whatever he tells you. Satisfy him no matter how much he nauseates you. This guy is probably very dangerous. If he gets angry, he'll kill us. Be strong, honey. I love you.\"\n\nTo which his wife responds: \"He wasn't kissing my neck. He was whispering in my ear. He told me he was gay, thought you were cute, and asked me if we had any vaseline. I told him it was in the bathroom. Be strong honey. I love you too!!\"",
        "id": "5tsy9f",
        "score": 592,
        "title": "A Man Escapes From Prison"
    },
    {
        "body": "They're starting a focus group.",
        "id": "5tsxy7",
        "score": 2,
        "title": "The worlds 4 most famous partially sighted musicians have got together."
    },
    {
        "body": "*boo*-bees ",
        "id": "5tsxno",
        "score": 0,
        "title": "What kind of bees make milk?"
    },
    {
        "body": "Sad and alone.",
        "id": "5tsx7f",
        "score": 1,
        "title": "I spend my valentines days like aging racist."
    },
    {
        "body": "Because they all want to fuck mother nature.",
        "id": "5tswwb",
        "score": 4,
        "title": "Humanity must have an Oedipus complex"
    },
    {
        "body": "Police are combing the area ",
        "id": "5tsv6s",
        "score": 11,
        "title": "Breaking: Donald Trumps hair has been reported as missing"
    },
    {
        "body": "So they can Scandinavian.",
        "id": "5tsud4",
        "score": 708,
        "title": "Why do they have bar codes on the returning Swedish fleet?"
    },
    {
        "body": "I couldn't even afford my electricity bills, they were the darkest times of my life.",
        "id": "5tsua0",
        "score": 9,
        "title": "I once got into so much debt"
    },
    {
        "body": "A treesome! ",
        "id": "5tstyf",
        "score": 4,
        "title": "What do you call two eco terrorists humping a tree?"
    },
    {
        "body": "Today, if I want to see her panties, I have to spread her butt cheeks.",
        "id": "5tsts2",
        "score": 200,
        "title": "Back then, if I wanted to see her panties, I had to lift her skirt."
    },
    {
        "body": "\nWhooops wrong sub!",
        "id": "5tsss4",
        "score": 6,
        "title": "ELI5 why can you get dishonorably discharged from the Navy for boarding the wrong vessel just once?"
    },
    {
        "body": "Apparently, she was seeing someone else on the side.",
        "id": "5tsqv9",
        "score": 905,
        "title": "I had to break up with my cross-eyed girlfriend..."
    },
    {
        "body": "Wrecking an 18-year-old's pussy.",
        "id": "5tsqe7",
        "score": 330,
        "title": "I hope I leave this world the same way I came into it..."
    },
    {
        "body": "The title says it all",
        "id": "5tsp5j",
        "score": 7,
        "title": "It all"
    },
    {
        "body": "It all started with a big bang!",
        "id": "5tso4n",
        "score": 18,
        "title": "I have this theory about the origin of orgies."
    },
    {
        "body": "Batman can go out without robin ;)",
        "id": "5tsne4",
        "score": 0,
        "title": "Whats the different between batman and a black man?"
    },
    {
        "body": "\"Why do you use a Samsung phone?\"\n\"To remind me that the apple was the first sin.\"\n\"So you are an atheist?\"\n\"Of course not! Why do you think that?\"\n\"Because I have notes on why Samsung's phones always end with a big bang!\"",
        "id": "5tsmou",
        "score": 2,
        "title": "A boy asks the Priest..."
    },
    {
        "body": "I guess you could say there's a real twist at the end...",
        "id": "5tsm5t",
        "score": 0,
        "title": "I finally watched Girl on the Train."
    },
    {
        "body": "A hatch opened and two little grey men with dazzling smiles appeared. They were promptly granted an audience with the Pope.\n\nAfter a brief discussion about the weather, the Pope said, \"I know this question may sound odd to you, but I was wondering if you and your kind knew about Jesus Christ?\"\n\n\"Jesus Christ?!\" exclaimed the slightly taller of two aliens. \"Of course we do! He visits our planet every two years or so. Awesome fellow!\"\n\nA hush descended on the audience chamber, and everyone watched the Pope, whose face had turned a rather odd purple.\n\n\"Every two years?\" he shouted. \"We're still waiting for his second coming!\"\n\n\"Maybe he didn't like your chocolate?\" suggested the alien.\n\n\"Chocolate?\" replied the Pope. \"What in heaven's name does chocolate have to do with it?\"\n\n\"Well,\" said the alien. \"When he came to our planet, we gave him chocolate. Why, what did you do?\"",
        "id": "5tslvm",
        "score": 2637,
        "title": "The alien vessel landed quietly on St Peter's square in Rome..."
    },
    {
        "body": "She was nervous but sat on one tall stool in front of the bartender..\n\nthe guy sitting on her left said: \"Jack Daniels, Single\"\n\nthe Guy on her right side ordered: \"Johnny Walker, Single\"\n\nnow the bartender looked at the lady & said, \"And You?\"\n\nLady replied: \"Yolanda, Married\"",
        "id": "5tsl7q",
        "score": 115,
        "title": "A Lady visited a bar for the first time.."
    },
    {
        "body": "Now I'm handiclapped",
        "id": "5tsk85",
        "score": 5,
        "title": "I got a venereal disease from a girl in a wheelchair"
    },
    {
        "body": "A cripflip",
        "id": "5tsjlt",
        "score": 1,
        "title": "What is a gang member's favorite skateboarding trick?"
    },
    {
        "body": "Neither have they.",
        "id": "5tsiwl",
        "score": 34,
        "title": "Ever tasted Ethiopian food?"
    },
    {
        "body": "But she didn't seem too happy when I took her tea shirt off.",
        "id": "5tsiki",
        "score": 1,
        "title": "This girl kept saying how Brits drank too much tea and how she hated it."
    },
    {
        "body": "Having said that, I love them.",
        "id": "5tsifd",
        "score": 4,
        "title": "I hate people who always sit on the fence with two opinions."
    },
    {
        "body": "He's having a mid-life crisis",
        "id": "5tshw2",
        "score": 89,
        "title": "What's wrong with that 5 year old Ethiopian?"
    },
    {
        "body": "Starbucks.",
        "id": "5tsfze",
        "score": 25,
        "title": "What currency do they use in outer space?"
    },
    {
        "body": "I read an article about drones recently. A software development firm was testing drones in the Amazon basin and developing mapping software when they began receiving strange anomalies in the data. \nThe drones were covering more area than they had modeled in the software. \nThey couldn't figure out why the drones were exceeding the units per second figures of their graphs. \nThat's when I realized: Amazon drones are always faster than U(nit)P(er)S(econd) estimations. ",
        "id": "5tsf10",
        "score": 0,
        "title": "Amazon Drones"
    },
    {
        "body": "She said, \"Stop wearing my bra's.\"",
        "id": "5tsdtg",
        "score": 3,
        "title": "I just removed my sister's bra."
    },
    {
        "body": "I mean, what do you get for your left hand?",
        "id": "5tsd1c",
        "score": 3,
        "title": "Valentine's Day is around the corner and I don't know what to get my partner..."
    },
    {
        "body": "With iPhone accessories.",
        "id": "5tscx1",
        "score": 5378,
        "title": "How do you milk sheep?"
    },
    {
        "body": "He was out standing in his field ",
        "id": "5tscve",
        "score": 0,
        "title": "How did the Scarecrow, win the award?"
    },
    {
        "body": "Successful",
        "id": "5tsbo6",
        "score": 8,
        "title": "What do you call a guy who gets lots of blowjobs?"
    },
    {
        "body": "They're both shiite ",
        "id": "5ts9xe",
        "score": 0,
        "title": "I bumped into Liam Gallagher in Manchester the other day and he told me this joke. \"What do Blur and Iranians have in common?\""
    },
    {
        "body": "Because he was bard!",
        "id": "5ts9rx",
        "score": 2,
        "title": "Why couldn't William Shakespeare go to the pub?"
    },
    {
        "body": "Is her gravitational pull  ",
        "id": "5ts9p9",
        "score": 12,
        "title": "The most attractive thing about your mom..."
    },
    {
        "body": "I only know because they told everyone within two minutes ",
        "id": "5ts95n",
        "score": 7,
        "title": "An atheist, a vegan and a CrossFitter walk into a bar"
    },
    {
        "body": "A time traveler walk into a bar",
        "id": "5ts940",
        "score": 9,
        "title": "So the bartender says \"I'm sorry, but we don't serve time travelers here\""
    },
    {
        "body": "Raindrops are dank\n\nMy father died. How?, my repulsive ass stank\n\n(not funny, but a valentines day related joke)",
        "id": "5ts88b",
        "score": 0,
        "title": "Roses are red"
    },
    {
        "body": "The first day, the priest was teaching him the new job. A girl walked into the church and confessed that she commited adultery once. The priest said: \"You need to donate one dollar to the church so God may forgive you\". So she did that and left. Then came another woman and confessed commiting adultery twice, so the priest told her she needs to donate two dollars to the church. Then the priest said:\"You got the hang of it, I'm going to the bathroom and you need to do the same thing until I come back, and remember, never take more money than you should\". When the priest came back he found the new guy fucking a woman on the altar, he got mad and started yelling: \"Are you out of your mind! What are you doing?!\" The sex addict replied: \"Calm down man, this one said she commited adultery eight times and she donated a 10 dollar bill and I didn't have any change to give back to her so I had to fuck her twice\".",
        "id": "5ts7vb",
        "score": 22,
        "title": "A sex addict decided to repent and volunteer in the local church..."
    },
    {
        "body": "His 4 children are there, 3 tall with red hair, 1 short with black hair, as well as his wife.\n\"Before I die, tell me,is that my child?\"He asks his wife, pointing to the shortest.\n\n\"I swear on everything that's your kid.\"The wife replies.\n\nRelieved the father then passes away. Shortly after he passes, his wife mutters \"Thank god he didn't ask about the other three.\"\n\n\n\n\n\nEdit: makes more sense, also some spacing.\n",
        "id": "5ts7td",
        "score": 5,
        "title": "A father is on his deathbed."
    }
]